#pragma once
        #include "丽莎.h"
        using namespace DB::RoleConstruct;
        using namespace Atom;
        using namespace Atom::Enum;
        using namespace Advanced;
        using namespace Professional;
        //TODO:AUTO丽莎.cpp
        const double HP =  9569.92523615167;
        const double ATK =  231.51294280828733;
        const double DEF =  573.318087431282;
        //元素精通
        const double OTHER = 96;
        
        丽莎::~丽莎() {
        }
        丽莎::丽莎(u32* frameCur):Role(frameCur) {
            BaseObject* baseData = new BaseObject();
            static Attr
			* HelathAttr = new Attr(HP, 0., 0.),
			* AtkAttr = new Attr(ATK, 0., 0.),
			* DefAttr = new Attr(DEF, 0., 0.),
			* CritRateAttr = new Attr(0.05, 0., 0.),
			* CritDamageAttr = new Attr(0.5, 0., 0.);
            baseData->SetAttr((u32)AttrType::Helath, HelathAttr);
		    baseData->SetAttr((u32)AttrType::Atk, AtkAttr);
		    baseData->SetAttr((u32)AttrType::Def, DefAttr);
		    baseData->SetAttr((u32)AttrType::CritRate, CritRateAttr);
		    baseData->SetAttr((u32)AttrType::CritDamage, CritDamageAttr);
            this->rawCharacter = new Character(baseData, CharacterGender::Female, CharacterGroup::Tivat, ElementType::Electro, WeaponType::Catalyst);
            delete baseData;
        };        

        /*
        
        ****1:电感余震
        ****************
        
            重击命中时，会为敌人附加❤苍雷❤的引雷效果。 

        ****************
        

        ****2:静电场力
        ****************
        
            敌人受到❤蔷薇的雷光❤攻击后，降低15%防御力，持续10秒。 

        ****************
        

        ****3:药剂通识
        ****************
        
            合成药剂时，有20%概率返还部分合成材料。 

        ****************
        
        */
        
            /*******普通攻击·指尖雷暴
             * 
             * **普通攻击**
             * 进行至多四段的电击，造成雷元素伤害。
             * 
             * **重击**
             * 消耗一定体力，短暂咏唱后，造成雷元素范围伤害。
             * 
             * **下落攻击**
             * 凝聚雷电的力量，从空中下坠冲击地面，攻击下落路径上的敌人，并在落地时造成雷元素范围伤害。
             * 
             * 一段伤害|{param1:F1P}
             * 二段伤害|{param2:F1P}
             * 三段伤害|{param3:F1P}
             * 四段伤害|{param4:F1P}
             * 重击伤害|{param5:P}
             * 重击体力消耗|{param6:F1}点
             * 下坠期间伤害|{param7:F1P}
             * 低空/高空坠地冲击伤害|{param8:P}/{param9:P}
            */
            void 丽莎::A(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[9]{ 0.3959999978542328,0.35920000076293945,0.42800000309944153,0.5496000051498413,1.7711999416351318,50,0.5682880282402039,1.136335015296936,1.4193439483642578},
                        new const double[9]{ 0.42570000886917114,0.38613998889923096,0.460099995136261,0.5908200144767761,1.904039978981018,50,0.6145439743995667,1.228827953338623,1.534872055053711},
                        new const double[9]{ 0.4553999900817871,0.41308000683784485,0.49219998717308044,0.6320400238037109,2.0368800163269043,50,0.6607999801635742,1.3213200569152832,1.6504000425338745},
                        new const double[9]{ 0.4950000047683716,0.4490000009536743,0.5350000262260437,0.6869999766349792,2.2139999866485596,50,0.7268800139427185,1.4534519910812378,1.815440058708191},
                        new const double[9]{ 0.5246999859809875,0.4759399890899658,0.5670999884605408,0.7282199859619141,2.3468399047851562,50,0.7731360197067261,1.5459439754486084,1.9309680461883545},
                        new const double[9]{ 0.5544000267982483,0.5028799772262573,0.5992000102996826,0.7694399952888489,2.479680061340332,50,0.8259999752044678,1.6516499519348145,2.062999963760376},
                        new const double[9]{ 0.593999981880188,0.5388000011444092,0.6420000195503235,0.824400007724762,2.6568000316619873,50,0.898688018321991,1.7969950437545776,2.24454402923584},
                        new const double[9]{ 0.6335999965667725,0.574720025062561,0.6848000288009644,0.879360020160675,2.8339200019836426,50,0.9713760018348694,1.9423400163650513,2.4260880947113037},
                        new const double[9]{ 0.6732000112533569,0.6106399893760681,0.7275999784469604,0.9343199729919434,3.011039972305298,50,1.0440640449523926,2.087686061859131,2.6076319217681885},
                        new const double[9]{ 0.7128000259399414,0.64656001329422,0.7703999876976013,0.9892799854278564,3.188159942626953,50,1.12336003780365,2.246243953704834,2.8056800365448},
                        new const double[9]{ 0.7539839744567871,0.6839169859886169,0.8149120211601257,1.0464379787445068,3.3723649978637695,50,1.2026560306549072,2.404802083969116,3.003727912902832},
                        new const double[9]{ 0.8078399896621704,0.7327679991722107,0.8731200098991394,1.12118399143219,3.613248109817505,50,1.2819520235061646,2.5633609294891357,3.2017760276794434},
                        new const double[9]{ 0.8616960048675537,0.7816190123558044,0.9313279986381531,1.195930004119873,3.854130983352661,50,1.3612480163574219,2.721919059753418,3.3998239040374756},
                        new const double[9]{ 0.915552020072937,0.8304700255393982,0.9895359873771667,1.2706749439239502,4.0950140953063965,50,1.4405440092086792,2.8804779052734375,3.597872018814087},
                        new const double[9]{ 0.9694079756736755,0.8793219923973083,1.0477440357208252,1.3454209566116333,4.335897922515869,50,1.5198400020599365,3.0390360355377197,3.795919895172119}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******苍雷
             * 
             * 导引雷电的力量，把麻烦的东西都清理干净。
             * 
             * **点按**
             * 放出能自行索敌的球形闪电。
             * 命中时，会造成雷元素伤害，并对小范围内的敌人施加至多叠加3层的引雷状态。
             * 
             * **长按**
             * 持续咏唱后，召唤雷电从天而降，对附近的所有敌人造成大量雷元素伤害。
             * 对处于引雷状态下的敌人，会根据叠加层数造成大量额外伤害，并清除引雷效果。
             * 
             * 点按伤害|{param6:F1P}
             * 点按冷却时间|{param7:F1}秒
             * 无引雷长按伤害|{param1:P}
             * 一层引雷长按伤害|{param2:P}
             * 二层引雷长按伤害|{param3:P}
             * 三层引雷长按伤害|{param4:P}
             * 长按冷却时间|{param5:F1}秒
            */
            void 丽莎::E(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[7]{ 3.200000047683716,3.680000066757202,4.239999771118164,4.872000217437744,16,0.800000011920929,1},
                        new const double[7]{ 3.440000057220459,3.9560000896453857,4.558000087738037,5.237400054931641,16,0.8600000143051147,1},
                        new const double[7]{ 3.680000066757202,4.23199987411499,4.875999927520752,5.602799892425537,16,0.9200000166893005,1},
                        new const double[7]{ 4,4.599999904632568,5.300000190734863,6.090000152587891,16,1,1},
                        new const double[7]{ 4.239999771118164,4.875999927520752,5.618000030517578,6.455399990081787,16,1.059999942779541,1},
                        new const double[7]{ 4.480000019073486,5.1519999504089355,5.935999870300293,6.820799827575684,16,1.1200000047683716,1},
                        new const double[7]{ 4.800000190734863,5.519999980926514,6.360000133514404,7.308000087738037,16,1.2000000476837158,1},
                        new const double[7]{ 5.119999885559082,5.888000011444092,6.783999919891357,7.795199871063232,16,1.2799999713897705,1},
                        new const double[7]{ 5.440000057220459,6.25600004196167,7.208000183105469,8.282400131225586,16,1.3600000143051147,1},
                        new const double[7]{ 5.760000228881836,6.624000072479248,7.631999969482422,8.769599914550781,16,1.440000057220459,1},
                        new const double[7]{ 6.079999923706055,6.992000102996826,8.055999755859375,9.256799697875977,16,1.5199999809265137,1},
                        new const double[7]{ 6.400000095367432,7.360000133514404,8.479999542236328,9.744000434875488,16,1.600000023841858,1},
                        new const double[7]{ 6.800000190734863,7.820000171661377,9.010000228881836,10.352999687194824,16,1.7000000476837158,1},
                        new const double[7]{ 7.199999809265137,8.279999732971191,9.539999961853027,10.961999893188477,16,1.7999999523162842,1},
                        new const double[7]{ 7.599999904632568,8.739999771118164,10.069999694824219,11.571000099182129,16,1.899999976158142,1}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******蔷薇的雷光
             * 
             * 召唤蔷薇雷光，释放强大的雷电之力，击退周围的敌人并造成雷元素伤害。
             * 存在期间内，蔷薇雷光会持续放电攻击附近的敌人，造成雷元素伤害。
             * 
             * 放电伤害|{param1:F1P}
             * 持续时间|{param2:F1}秒
             * 冷却时间|{param3:F1}秒
             * 元素能量|{param4:I}
            */
            void 丽莎::Q(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[4]{ 0.36559998989105225,15,20,80},
                        new const double[4]{ 0.39302000403404236,15,20,80},
                        new const double[4]{ 0.4204399883747101,15,20,80},
                        new const double[4]{ 0.4569999873638153,15,20,80},
                        new const double[4]{ 0.4844200015068054,15,20,80},
                        new const double[4]{ 0.5118399858474731,15,20,80},
                        new const double[4]{ 0.5483999848365784,15,20,80},
                        new const double[4]{ 0.5849599838256836,15,20,80},
                        new const double[4]{ 0.6215199828147888,15,20,80},
                        new const double[4]{ 0.658079981803894,15,20,80},
                        new const double[4]{ 0.6946399807929993,15,20,80},
                        new const double[4]{ 0.7311999797821045,15,20,80},
                        new const double[4]{ 0.7768999934196472,15,20,80},
                        new const double[4]{ 0.8226000070571899,15,20,80},
                        new const double[4]{ 0.8683000206947327,15,20,80}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };
        /*****丽莎
        
            ***1命***
            无限的电回路            
            ❤苍雷❤长按时，每个命中的敌人都会为丽莎恢复2点元素能量。通过这种方式，一次至多回复10点元素能量。
            
            ***2命***
            空间电势结界            
            ❤苍雷❤长按时，具有如下效果：·防御力提升25%；·提高丽莎的抗打断能力。
            
            ***3命***
            谐振的雷光            
            ❤蔷薇的雷光❤的技能等级提高3级。至多提升至15级。
            
            ***4命***
            如雨的电浆            
            ❤蔷薇的雷光❤攻击时，放出的闪电增加至1~3道。
            
            ***5命***
            等离态的落雷            
            ❤苍雷❤的技能等级提高3级。至多提升至15级。
            
            ***6命***
            脉冲的魔女            
            丽莎登场时，对附近的敌人施加3层❤苍雷❤的引雷效果。该效果每5秒只能触发一次。
            
        */
         
        