#pragma once
        #include "九条裟罗.h"
        using namespace DB::RoleConstruct;
        using namespace Atom;
        using namespace Atom::Enum;
        using namespace Advanced;
        using namespace Professional;
        //TODO:AUTO九条裟罗.cpp
        const double HP =  9569.92523615167;
        const double ATK =  195.40541430358826;
        const double DEF =  627.9197915615769;
        //攻击力
        const double OTHER = 0.23999999463558197;
        
        九条裟罗::~九条裟罗() {
        }
        九条裟罗::九条裟罗(u32* frameCur) {
            _framCur = frameCur;
            BaseObject* baseData = new BaseObject();
            static Attr
			* HelathAttr = new Attr(HP, 0., 0.),
			* AtkAttr = new Attr(ATK, 0., 0.),
			* DefAttr = new Attr(DEF, 0., 0.),
			* CritRateAttr = new Attr(0.05, 0., 0.),
			* CritDamageAttr = new Attr(0.5, 0., 0.);
            baseData->SetAttr((u32)AttrType::Helath, HelathAttr);
		    baseData->SetAttr((u32)AttrType::Atk, AtkAttr);
		    baseData->SetAttr((u32)AttrType::Def, DefAttr);
		    baseData->SetAttr((u32)AttrType::CritRate, CritRateAttr);
		    baseData->SetAttr((u32)AttrType::CritDamage, CritDamageAttr);
            this->rawCharacter = new Character(baseData, CharacterGender::Female, CharacterGroup::Tivat, ElementType::Electro, WeaponType::Bow);
            delete baseData;
        };        

        /*
        
        ****1:不动心
        ****************
        
            处于❤鸦羽天狗霆雷召咒❤的「乌羽护持」状态下时，瞄准射击的所需的蓄力时间减少60%。 

        ****************
        

        ****2:御公仪
        ****************
        
            天狗咒雷·伏命中敌人后，将基于九条裟罗的元素充能效率，每100%为队伍中所有角色恢复1.2点元素能量。该效果每3秒至多触发一次。 

        ****************
        

        ****3:检地
        ****************
        
            在稻妻执行探索派遣任务时，消耗的时间缩短25%。 

        ****************
        
        */
        
            /*******普通攻击·天狗传弓术
            一段伤害|{param1:F1P}
            二段伤害|{param2:F1P}
            三段伤害|{param3:F1P}
            四段伤害|{param4:F1P}
            五段伤害|{param5:F1P}
            瞄准射击|{param6:F1P}
            满蓄力瞄准射击|{param7:P}
            下坠期间伤害|{param8:F1P}
            低空/高空坠地冲击伤害|{param9:P}/{param10:P}
            */
            void 九条裟罗::A(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[10]{ 0.36893999576568604,0.3869999945163727,0.48504000902175903,0.5039600133895874,0.5805000066757202,0.43860000371932983,1.2400000095367432,0.5682880282402039,1.136335015296936,1.4193439483642578},
                        new const double[10]{ 0.39897000789642334,0.41850000619888306,0.5245199799537659,0.544979989528656,0.6277499794960022,0.47429999709129333,1.3329999446868896,0.6145439743995667,1.228827953338623,1.534872055053711},
                        new const double[10]{ 0.42899999022483826,0.44999998807907104,0.5640000104904175,0.5860000252723694,0.675000011920929,0.5099999904632568,1.4259999990463257,0.6607999801635742,1.3213200569152832,1.6504000425338745},
                        new const double[10]{ 0.47189998626708984,0.4950000047683716,0.6204000115394592,0.644599974155426,0.7425000071525574,0.5609999895095825,1.5499999523162842,0.7268800139427185,1.4534519910812378,1.815440058708191},
                        new const double[10]{ 0.5019299983978271,0.5264999866485596,0.6598799824714661,0.6856200098991394,0.7897499799728394,0.5967000126838684,1.6430000066757202,0.7731360197067261,1.5459439754486084,1.9309680461883545},
                        new const double[10]{ 0.5362499952316284,0.5625,0.7049999833106995,0.7325000166893005,0.84375,0.637499988079071,1.7359999418258667,0.8259999752044678,1.6516499519348145,2.062999963760376},
                        new const double[10]{ 0.5834400057792664,0.6119999885559082,0.7670400142669678,0.7969599962234497,0.9179999828338623,0.6935999989509583,1.8600000143051147,0.898688018321991,1.7969950437545776,2.24454402923584},
                        new const double[10]{ 0.6306300163269043,0.6614999771118164,0.8290799856185913,0.8614199757575989,0.9922500252723694,0.7497000098228455,1.9839999675750732,0.9713760018348694,1.9423400163650513,2.4260880947113037},
                        new const double[10]{ 0.6778200268745422,0.7110000252723694,0.8911200165748596,0.9258800148963928,1.066499948501587,0.8058000206947327,2.1080000400543213,1.0440640449523926,2.087686061859131,2.6076319217681885},
                        new const double[10]{ 0.7293000221252441,0.7649999856948853,0.9588000178337097,0.9962000250816345,1.1475000381469727,0.8669999837875366,2.2320001125335693,1.12336003780365,2.246243953704834,2.8056800365448},
                        new const double[10]{ 0.780780017375946,0.8190000057220459,1.026479959487915,1.0665199756622314,1.2285000085830688,0.9282000064849854,2.3559999465942383,1.2026560306549072,2.404802083969116,3.003727912902832},
                        new const double[10]{ 0.832260012626648,0.8730000257492065,1.0941599607467651,1.1368399858474731,1.309499979019165,0.9894000291824341,2.4800000190734863,1.2819520235061646,2.5633609294891357,3.2017760276794434},
                        new const double[10]{ 0.8837400078773499,0.9269999861717224,1.1618399620056152,1.2071599960327148,1.3904999494552612,1.0506000518798828,2.634999990463257,1.3612480163574219,2.721919059753418,3.3998239040374756},
                        new const double[10]{ 0.9352200031280518,0.9810000061988831,1.2295199632644653,1.2774800062179565,1.471500039100647,1.111799955368042,2.7899999618530273,1.4405440092086792,2.8804779052734375,3.597872018814087},
                        new const double[10]{ 0.9866999983787537,1.034999966621399,1.2971999645233154,1.3478000164031982,1.5525000095367432,1.1729999780654907,2.944999933242798,1.5198400020599365,3.0390360355377197,3.795919895172119}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******鸦羽天狗霆雷召咒
            天狗咒雷·伏 伤害|{param1:F1P}
            攻击力加成比例|{param2:P}
            攻击力加成持续时间|{param3:F1}秒
            冷却时间|{param4:F1}秒
            */
            void 九条裟罗::E(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[4]{ 1.257599949836731,0.4296000003814697,6,10},
                        new const double[4]{ 1.3519200086593628,0.46182000637054443,6,10},
                        new const double[4]{ 1.446239948272705,0.49404001235961914,6,10},
                        new const double[4]{ 1.5720000267028809,0.5370000004768372,6,10},
                        new const double[4]{ 1.6663199663162231,0.5692200064659119,6,10},
                        new const double[4]{ 1.760640025138855,0.6014400124549866,6,10},
                        new const double[4]{ 1.8863999843597412,0.6444000005722046,6,10},
                        new const double[4]{ 2.012160062789917,0.6873599886894226,6,10},
                        new const double[4]{ 2.1379199028015137,0.7303199768066406,6,10},
                        new const double[4]{ 2.2636799812316895,0.7732800245285034,6,10},
                        new const double[4]{ 2.3894400596618652,0.8162400126457214,6,10},
                        new const double[4]{ 2.515199899673462,0.8592000007629395,6,10},
                        new const double[4]{ 2.6723999977111816,0.9128999710083008,6,10},
                        new const double[4]{ 2.8296000957489014,0.9666000008583069,6,10},
                        new const double[4]{ 2.986799955368042,1.020300030708313,6,10}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******煌煌千道镇式
            天狗咒雷·金刚坏 伤害|{param1:F1P}
            天狗咒雷·雷砾 伤害|{param2:F1P}
            冷却时间|{param3:F1}秒
            元素能量|{param4:I}
            */
            void 九条裟罗::Q(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[4]{ 4.0960001945495605,0.34119999408721924,20,80},
                        new const double[4]{ 4.403200149536133,0.3667899966239929,20,80},
                        new const double[4]{ 4.710400104522705,0.3923799991607666,20,80},
                        new const double[4]{ 5.119999885559082,0.42649999260902405,20,80},
                        new const double[4]{ 5.427199840545654,0.45208999514579773,20,80},
                        new const double[4]{ 5.734399795532227,0.4776799976825714,20,80},
                        new const double[4]{ 6.144000053405762,0.5117999911308289,20,80},
                        new const double[4]{ 6.553599834442139,0.5459200143814087,20,80},
                        new const double[4]{ 6.963200092315674,0.5800399780273438,20,80},
                        new const double[4]{ 7.372799873352051,0.6141600012779236,20,80},
                        new const double[4]{ 7.782400131225586,0.6482800245285034,20,80},
                        new const double[4]{ 8.192000389099121,0.6823999881744385,20,80},
                        new const double[4]{ 8.704000473022461,0.7250499725341797,20,80},
                        new const double[4]{ 9.215999603271484,0.7677000164985657,20,80},
                        new const double[4]{ 9.727999687194824,0.8103500008583069,20,80}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };
        /*****九条裟罗
        
            ***1命***
            乌眼            
            天狗咒雷为角色施加攻击力提升效果或命中敌人后，❤鸦羽天狗霆雷召咒❤的冷却时间减少1秒。该效果每3秒至多触发一次。
            
            ***2命***
            鸦羽            
            施放❤鸦羽天狗霆雷召咒❤时，会在九条裟罗原本的位置留下能引发一次较弱的天狗咒雷·伏的「乌羽」，造成原本30%的伤害。
            
            ***3命***
            心魔            
            ❤煌煌千道镇式❤的技能等级提高3级。至多提升至15级。
            
            ***4命***
            彻证            
            ❤煌煌千道镇式❤释放的天狗咒雷·雷砾增加至6道。
            
            ***5命***
            咒咏            
            ❤鸦羽天狗霆雷召咒❤的技能等级提高3级。至多提升至15级。
            
            ***6命***
            我界            
            处于天狗咒雷带来的攻击力提升效果状态下的角色，其雷元素伤害的暴击伤害提高60%。
            
        */
         
        