#pragma once
        #include "八重神子.h"
        using namespace DB::RoleConstruct;
        using namespace Atom;
        using namespace Atom::Enum;
        using namespace Advanced;
        using namespace Professional;
        //TODO:AUTO八重神子.cpp
        const double HP =  10372.286724925274;
        const double ATK =  339.63329738233006;
        const double DEF =  568.7302449914278;
        //暴击率
        const double OTHER = 0.2420000024139881;
        
        八重神子::~八重神子() {
        }
        八重神子::八重神子(u32* frameCur) {
            _framCur = frameCur;
            BaseObject* baseData = new BaseObject();
            static Attr
			* HelathAttr = new Attr(HP, 0., 0.),
			* AtkAttr = new Attr(ATK, 0., 0.),
			* DefAttr = new Attr(DEF, 0., 0.),
			* CritRateAttr = new Attr(0.05, 0., 0.),
			* CritDamageAttr = new Attr(0.5, 0., 0.);
            baseData->SetAttr((u32)AttrType::Helath, HelathAttr);
		    baseData->SetAttr((u32)AttrType::Atk, AtkAttr);
		    baseData->SetAttr((u32)AttrType::Def, DefAttr);
		    baseData->SetAttr((u32)AttrType::CritRate, CritRateAttr);
		    baseData->SetAttr((u32)AttrType::CritDamage, CritDamageAttr);
            this->rawCharacter = new Character(baseData, CharacterGender::Female, CharacterGroup::Tivat, ElementType::Electro, WeaponType::Catalyst);
            delete baseData;
        };        

        /*
        
        ****1:神篱之御荫
        ****************
        
            施放❤大密法·天狐显真❤时，每摧毁一株杀生樱，就会重置一次❤野干役咒·杀生樱❤的冷却时间。 

        ****************
        

        ****2:启蜇之祝词
        ****************
        
            八重神子的每点元素精通，能使❤杀生樱❤造成的伤害提升0.15%。 

        ****************
        

        ****3:野狐说禅
        ****************
        
            合成角色天赋素材时，有25%概率额外产生一份地区相同的其他随机天赋素材，等阶与合成所消耗的素材相同。 

        ****************
        
        */
        
            /*******普通攻击·狐灵食罪式
            一段伤害|{param1:F1P}
            二段伤害|{param2:F1P}
            三段伤害|{param3:F1P}
            重击伤害|{param4:F1P}
            重击体力消耗|{param5:F1}点
            下坠期间伤害|{param6:F1P}
            低空/高空坠地冲击伤害|{param7:P}/{param8:P}
            */
            void 八重神子::A(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[8]{ 0.39658400416374207,0.38519200682640076,0.5688880085945129,1.4289480447769165,50,0.5682880282402039,1.136335015296936,1.4193439483642578},
                        new const double[8]{ 0.42632800340652466,0.41408100724220276,0.6115549802780151,1.536120057106018,50,0.6145439743995667,1.228827953338623,1.534872055053711},
                        new const double[8]{ 0.45607200264930725,0.44297099113464355,0.6542209982872009,1.6432909965515137,50,0.6607999801635742,1.3213200569152832,1.6504000425338745},
                        new const double[8]{ 0.4957300126552582,0.48148998618125916,0.71110999584198,1.7861850261688232,50,0.7268800139427185,1.4534519910812378,1.815440058708191},
                        new const double[8]{ 0.5254740118980408,0.5103790163993835,0.753777027130127,1.8933570384979248,50,0.7731360197067261,1.5459439754486084,1.9309680461883545},
                        new const double[8]{ 0.555217981338501,0.539268970489502,0.796442985534668,2.00052809715271,50,0.8259999752044678,1.6516499519348145,2.062999963760376},
                        new const double[8]{ 0.5948759913444519,0.5777879953384399,0.853331983089447,2.143423080444336,50,0.898688018321991,1.7969950437545776,2.24454402923584},
                        new const double[8]{ 0.6345340013504028,0.6163070201873779,0.9102209806442261,2.2863171100616455,50,0.9713760018348694,1.9423400163650513,2.4260880947113037},
                        new const double[8]{ 0.6741930246353149,0.6548259854316711,0.9671099781990051,2.4292120933532715,50,1.0440640449523926,2.087686061859131,2.6076319217681885},
                        new const double[8]{ 0.7138509750366211,0.6933460235595703,1.0239980220794678,2.5721070766448975,50,1.12336003780365,2.246243953704834,2.8056800365448},
                        new const double[8]{ 0.7535099983215332,0.7318649888038635,1.080886960029602,2.7150020599365234,50,1.2026560306549072,2.404802083969116,3.003727912902832},
                        new const double[8]{ 0.7931680083274841,0.7703840136528015,1.1377760171890259,2.8578970432281494,50,1.2819520235061646,2.5633609294891357,3.2017760276794434},
                        new const double[8]{ 0.8427410125732422,0.8185330033302307,1.208886981010437,3.0365149974823,50,1.3612480163574219,2.721919059753418,3.3998239040374756},
                        new const double[8]{ 0.8923140168190002,0.8666819930076599,1.2799979448318481,3.2151339054107666,50,1.4405440092086792,2.8804779052734375,3.597872018814087},
                        new const double[8]{ 0.9418870210647583,0.9148309826850891,1.3511090278625488,3.393752098083496,50,1.5198400020599365,3.0390360355377197,3.795919895172119}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******野干役咒·杀生樱
            杀生樱伤害·壹阶|{param1:F1P}
            杀生樱伤害·贰阶|{param2:F1P}
            杀生樱伤害·叁阶|{param3:F1P}
            杀生樱伤害·肆阶|{param4:F1P}
            持续时间|{param5:F1}秒
            冷却时间|{param6:F1}秒
            */
            void 八重神子::E(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[6]{ 0.606719970703125,0.758400022983551,0.9480000138282776,1.184999942779541,14,4},
                        new const double[6]{ 0.6522240042686462,0.815280020236969,1.0190999507904053,1.2738749980926514,14,4},
                        new const double[6]{ 0.6977279782295227,0.872160017490387,1.0901999473571777,1.3627500534057617,14,4},
                        new const double[6]{ 0.758400022983551,0.9480000138282776,1.184999942779541,1.4812500476837158,14,4},
                        new const double[6]{ 0.8039039969444275,1.0048799514770508,1.256100058555603,1.5701249837875366,14,4},
                        new const double[6]{ 0.849407970905304,1.0617599487304688,1.3272000551223755,1.659000039100647,14,4},
                        new const double[6]{ 0.9100800156593323,1.1375999450683594,1.4220000505447388,1.777500033378601,14,4},
                        new const double[6]{ 0.9707520008087158,1.21343994140625,1.516800045967102,1.8960000276565552,14,4},
                        new const double[6]{ 1.0314240455627441,1.2892800569534302,1.6116000413894653,2.0144999027252197,14,4},
                        new const double[6]{ 1.092095971107483,1.3651200532913208,1.7064000368118286,2.132999897003174,14,4},
                        new const double[6]{ 1.1527680158615112,1.4409600496292114,1.801200032234192,2.251499891281128,14,4},
                        new const double[6]{ 1.21343994140625,1.516800045967102,1.8960000276565552,2.369999885559082,14,4},
                        new const double[6]{ 1.2892800569534302,1.6116000413894653,2.0144999027252197,2.518125057220459,14,4},
                        new const double[6]{ 1.3651200532913208,1.7064000368118286,2.132999897003174,2.666249990463257,14,4},
                        new const double[6]{ 1.4409600496292114,1.801200032234192,2.251499891281128,2.8143749237060547,14,4}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******大密法·天狐显真
            技能伤害|{param1:P}
            天狐霆雷伤害|{param2:P}
            冷却时间|{param3:F1}秒
            元素能量|{param4:I}
            */
            void 八重神子::Q(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[4]{ 2.5999999046325684,3.3381600379943848,22,90},
                        new const double[4]{ 2.7950000762939453,3.588521957397461,22,90},
                        new const double[4]{ 2.990000009536743,3.838884115219116,22,90},
                        new const double[4]{ 3.25,4.172699928283691,22,90},
                        new const double[4]{ 3.444999933242798,4.423061847686768,22,90},
                        new const double[4]{ 3.640000104904175,4.673423767089844,22,90},
                        new const double[4]{ 3.9000000953674316,5.007239818572998,22,90},
                        new const double[4]{ 4.159999847412109,5.341055870056152,22,90},
                        new const double[4]{ 4.420000076293945,5.674871921539307,22,90},
                        new const double[4]{ 4.679999828338623,6.008687973022461,22,90},
                        new const double[4]{ 4.940000057220459,6.342504024505615,22,90},
                        new const double[4]{ 5.199999809265137,6.6763200759887695,22,90},
                        new const double[4]{ 5.525000095367432,7.093589782714844,22,90},
                        new const double[4]{ 5.849999904632568,7.510859966278076,22,90},
                        new const double[4]{ 6.175000190734863,7.928130149841309,22,90}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };
        /*****八重神子
        
            ***1命***
            野狐供真篇            
            ❤大密法·天狐显真❤每引发一次天狐霆雷，都会为八重神子自己恢复8点元素能量。
            
            ***2命***
            望月吼哕声            
            ❤杀生樱❤创造时的初始位阶提升至贰阶，位阶上限提升至肆阶，攻击范围提升60%。
            
            ***3命***
            七段妙变化            
            ❤野干役咒·杀生樱❤的技能等级提高3级。至多提升至15级。
            
            ***4命***
            绯樱引雷章            
            ❤杀生樱❤的落雷命中敌人后，队伍中附近的所有角色获得20%雷元素伤害加成，持续5秒。
            
            ***5命***
            暴恶嗤笑面            
            ❤大密法·天狐显真❤的技能等级提高3级。至多提升至15级。
            
            ***6命***
            大杀生咒禁            
            ❤杀生樱❤在攻击时无视敌人60%的防御力。
            
        */
         
        