#pragma once
        #include "菲谢尔.h"
        using namespace DB::RoleConstruct;
        //TODO:AUTO菲谢尔.cpp
        const double HP =  9189.302834416274;
        const double ATK =  244.256775675296;
        const double DEF =  593.7937441455288;
        //攻击力
        const double OTHER = 0.23999999463558197;
        
        菲谢尔::~菲谢尔() {
        }
        菲谢尔::菲谢尔() {
            BaseObject* baseData = new BaseObject();
            static Attr
			* HelathAttr = new Attr(HP, 0., 0.),
			* AtkAttr = new Attr(ATK, 0., 0.),
			* DefAttr = new Attr(DEF, 0., 0.),
			* CritRateAttr = new Attr(0.05, 0., 0.),
			* CritDamageAttr = new Attr(0.5, 0., 0.);
            baseData->SetAttr((u32)AttrType::Helath, HelathAttr);
		    baseData->SetAttr((u32)AttrType::Atk, AtkAttr);
		    baseData->SetAttr((u32)AttrType::Def, DefAttr);
		    baseData->SetAttr((u32)AttrType::CritRate, CritRateAttr);
		    baseData->SetAttr((u32)AttrType::CritDamage, CritDamageAttr);
            this->rawCharacter = new Character(baseData, CharacterGender::Female, CharacterGroup::Tivat, ElementType::Electro, WeaponType::Bow);
            delete baseData;
        };        

        /*
        
        ****1:噬星魔鸦
        ****************
        
            菲谢尔以蓄力完成的瞄准射击命中奥兹时，奥兹会对附近敌人降下圣裁之雷，造成等同射击伤害152.7%的雷元素范围伤害。 

        ****************
        

        ****2:断罪雷影
        ****************
        
            奥兹在场时，若当前场上自己的角色攻击敌人时触发了雷元素相关反应，则会对敌人降下圣裁之雷，造成菲谢尔80%攻击力的雷元素伤害。 

        ****************
        

        ****3:吾之后花园
        ****************
        
            在蒙德执行探索派遣任务时，消耗的时间缩短25%。 

        ****************
        
        */
        
            /*******普通攻击·罪灭之矢
            一段伤害|{param1:F1P}
            二段伤害|{param2:F1P}
            三段伤害|{param3:F1P}
            四段伤害|{param4:F1P}
            五段伤害|{param5:F1P}
            瞄准射击|{param6:F1P}
            满蓄力瞄准射击|{param7:P}
            下坠期间伤害|{param8:F1P}
            低空/高空坠地冲击伤害|{param9:P}/{param10:P}
            */
            void 菲谢尔::A(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[10]{ 0.4411799907684326,0.4678399860858917,0.5813599824905396,0.5770599842071533,0.7206799983978271,0.43860000371932983,1.2400000095367432,0.5682880282402039,1.136335015296936,1.4193439483642578},
                        new const double[10]{ 0.4770900011062622,0.5059199929237366,0.6286799907684326,0.6240299940109253,0.7793400287628174,0.47429999709129333,1.3329999446868896,0.6145439743995667,1.228827953338623,1.534872055053711},
                        new const double[10]{ 0.5130000114440918,0.5440000295639038,0.6759999990463257,0.6710000038146973,0.8379999995231628,0.5099999904632568,1.4259999990463257,0.6607999801635742,1.3213200569152832,1.6504000425338745},
                        new const double[10]{ 0.564300000667572,0.5983999967575073,0.7436000108718872,0.738099992275238,0.9218000173568726,0.5609999895095825,1.5499999523162842,0.7268800139427185,1.4534519910812378,1.815440058708191},
                        new const double[10]{ 0.6002100110054016,0.6364799737930298,0.7909200191497803,0.78507000207901,0.980459988117218,0.5967000126838684,1.6430000066757202,0.7731360197067261,1.5459439754486084,1.9309680461883545},
                        new const double[10]{ 0.6412500143051147,0.6800000071525574,0.8450000286102295,0.8387500047683716,1.0475000143051147,0.637499988079071,1.7359999418258667,0.8259999752044678,1.6516499519348145,2.062999963760376},
                        new const double[10]{ 0.6976799964904785,0.7398399710655212,0.9193599820137024,0.912559986114502,1.139680027961731,0.6935999989509583,1.8600000143051147,0.898688018321991,1.7969950437545776,2.24454402923584},
                        new const double[10]{ 0.7541099786758423,0.7996799945831299,0.9937199950218201,0.9863700270652771,1.2318600416183472,0.7497000098228455,1.9839999675750732,0.9713760018348694,1.9423400163650513,2.4260880947113037},
                        new const double[10]{ 0.8105400204658508,0.8595200181007385,1.068079948425293,1.0601799488067627,1.3240400552749634,0.8058000206947327,2.1080000400543213,1.0440640449523926,2.087686061859131,2.6076319217681885},
                        new const double[10]{ 0.8720999956130981,0.9247999787330627,1.1491999626159668,1.1406999826431274,1.4246000051498413,0.8669999837875366,2.2320001125335693,1.12336003780365,2.246243953704834,2.8056800365448},
                        new const double[10]{ 0.9336599707603455,0.9900799989700317,1.2303199768066406,1.2212200164794922,1.5251599550247192,0.9282000064849854,2.3559999465942383,1.2026560306549072,2.404802083969116,3.003727912902832},
                        new const double[10]{ 0.9952200055122375,1.055359959602356,1.3114399909973145,1.301740050315857,1.6257200241088867,0.9894000291824341,2.4800000190734863,1.2819520235061646,2.5633609294891357,3.2017760276794434},
                        new const double[10]{ 1.0567799806594849,1.1206400394439697,1.3925600051879883,1.3822599649429321,1.7262799739837646,1.0506000518798828,2.634999990463257,1.3612480163574219,2.721919059753418,3.3998239040374756},
                        new const double[10]{ 1.118340015411377,1.185920000076294,1.473680019378662,1.4627799987792969,1.8268400430679321,1.111799955368042,2.7899999618530273,1.4405440092086792,2.8804779052734375,3.597872018814087},
                        new const double[10]{ 1.179900050163269,1.2511999607086182,1.554800033569336,1.5433000326156616,1.92739999294281,1.1729999780654907,2.944999933242798,1.5198400020599365,3.0390360355377197,3.795919895172119}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******夜巡影翼
            奥兹攻击伤害|{param1:F1P}
            召唤伤害|{param2:P}
            奥兹存在时间|{param4:F1}秒
            冷却时间|{param5:F1}秒
            */
            void 菲谢尔::E(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[5]{ 0.8880000114440918,1.1543999910354614,10,25,8},
                        new const double[5]{ 0.9545999765396118,1.2409800291061401,10,25,8},
                        new const double[5]{ 1.0211999416351318,1.3275599479675293,10,25,8},
                        new const double[5]{ 1.1100000143051147,1.4429999589920044,10,25,8},
                        new const double[5]{ 1.1765999794006348,1.529579997062683,10,25,8},
                        new const double[5]{ 1.2431999444961548,1.6161600351333618,10,25,8},
                        new const double[5]{ 1.3320000171661377,1.731600046157837,10,25,8},
                        new const double[5]{ 1.420799970626831,1.847040057182312,10,25,8},
                        new const double[5]{ 1.509600043296814,1.9624799489974976,10,25,8},
                        new const double[5]{ 1.5983999967575073,2.0779199600219727,10,25,8},
                        new const double[5]{ 1.6871999502182007,2.1933600902557373,10,25,8},
                        new const double[5]{ 1.7760000228881836,2.308799982070923,10,25,8},
                        new const double[5]{ 1.8869999647140503,2.4530999660491943,10,25,8},
                        new const double[5]{ 1.9980000257492065,2.597399950027466,10,25,8},
                        new const double[5]{ 2.1089999675750732,2.7416999340057373,10,25,8}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******至夜幻现
            落雷伤害|{param1:P}
            冷却时间|{param5:F1}秒
            元素能量|{param6:I}
            */
            void 菲谢尔::Q(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[3]{ 2.0799999237060547,15,60},
                        new const double[3]{ 2.2360000610351562,15,60},
                        new const double[3]{ 2.3919999599456787,15,60},
                        new const double[3]{ 2.5999999046325684,15,60},
                        new const double[3]{ 2.75600004196167,15,60},
                        new const double[3]{ 2.9119999408721924,15,60},
                        new const double[3]{ 3.119999885559082,15,60},
                        new const double[3]{ 3.328000068664551,15,60},
                        new const double[3]{ 3.5360000133514404,15,60},
                        new const double[3]{ 3.74399995803833,15,60},
                        new const double[3]{ 3.9519999027252197,15,60},
                        new const double[3]{ 4.159999847412109,15,60},
                        new const double[3]{ 4.420000076293945,15,60},
                        new const double[3]{ 4.679999828338623,15,60},
                        new const double[3]{ 4.940000057220459,15,60}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };
        /*****菲谢尔
        
            ***1命***
            幽邃鸦眼            
            奥兹不在战场上时，也会透过鸦眼守望菲谢尔。在菲谢尔对敌人进行普通攻击时，奥兹会通过鸦眼协同攻击，造成22%攻击力的伤害。
            
            ***2命***
            圣裁影羽            
            施放❤夜巡影翼❤时，能额外造成200%攻击力的伤害，并使影响范围扩大50%。
            
            ***3命***
            渊色黑翼            
            ❤夜巡影翼❤的技能等级提高3级。至多提升至15级。
            
            ***4命***
            皇女幻绮谭            
            施放❤至夜幻现❤时，会对周围的敌人造成222%攻击力的雷元素伤害；技能效果结束时，会为菲谢尔恢复20%生命值。
            
            ***5命***
            至夜默示录            
            ❤至夜幻现❤的技能等级提高3级。至多提升至15级。
            
            ***6命***
            永夜之禽            
            奥兹的存在时间延长2秒。此外，奥兹会协同当前场上自己的角色一起攻击，造成菲谢尔30%攻击力的雷元素伤害。
            
        */
         
        