#pragma once
        #include "温迪.h"
        using namespace DB::RoleConstruct;
        using namespace Atom;
        using namespace Atom::Enum;
        using namespace Advanced;
        using namespace Professional;
        //TODO:AUTO温迪.cpp
        const double HP =  10531.48386939941;
        const double ATK =  263.09622679515087;
        const double DEF =  668.6423311858234;
        //元素充能效率
        const double OTHER = 0.3199999928474426;
        
        温迪::~温迪() {
        }
        温迪::温迪(u32* frameCur):Role(frameCur) {
            BaseObject* baseData = new BaseObject();
            static Attr
			* HelathAttr = new Attr(HP, 0., 0.),
			* AtkAttr = new Attr(ATK, 0., 0.),
			* DefAttr = new Attr(DEF, 0., 0.),
			* CritRateAttr = new Attr(0.05, 0., 0.),
			* CritDamageAttr = new Attr(0.5, 0., 0.);
            baseData->SetAttr((u32)AttrType::Helath, HelathAttr);
		    baseData->SetAttr((u32)AttrType::Atk, AtkAttr);
		    baseData->SetAttr((u32)AttrType::Def, DefAttr);
		    baseData->SetAttr((u32)AttrType::CritRate, CritRateAttr);
		    baseData->SetAttr((u32)AttrType::CritDamage, CritDamageAttr);
            this->rawCharacter = new Character(baseData, CharacterGender::Male, CharacterGroup::Tivat, ElementType::Anemo, WeaponType::Bow);
            delete baseData;
        };        

        /*
        
        ****1:绪风之拥
        ****************
        
            长按❤高天之歌❤后，会产生上升气流，持续20秒。 

        ****************
        

        ****2:暴风之眼
        ****************
        
            ❤风神之诗❤效果结束后，会为温迪恢复15点元素能量；
            若产生了元素转化，则同样为队伍中所有对应元素的角色恢复15点元素能量。 

        ****************
        

        ****3:恒风随行
        ****************
        
            队伍中自己的角色滑翔消耗的体力降低20%。
            无法与效果完全相同的固有天赋叠加。 

        ****************
        
        */
        
            /*******普通攻击·神代射术
             * 
             * **普通攻击**
             * 进行至多六段的连续弓箭射击。
             * 
             * **重击**
             * 进行伤害更高、更为精准的**瞄准射击**。
             * 瞄准时，眷顾天地的风会在箭矢上持续积聚。聚满了风之力的箭矢会造成风元素伤害。
             * 
             * **下落攻击**
             * 从空中射出箭雨，并迅速下坠冲击地面，在落地时造成范围伤害。
             * 
             * 一段伤害|{param1:F1P}+{param1:F1P}
             * 二段伤害|{param2:F1P}
             * 三段伤害|{param3:F1P}
             * 四段伤害|{param4:F1P}+{param4:F1P}
             * 五段伤害|{param5:F1P}
             * 六段伤害|{param6:F1P}
             * 瞄准射击|{param7:F1P}
             * 满蓄力瞄准射击|{param8:P}
             * 下坠期间伤害|{param9:F1P}
             * 低空/高空坠地冲击伤害|{param10:P}/{param11:P}
            */
            void 温迪::A(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[11]{ 0.20382000505924225,0.4437600076198578,0.5237399935722351,0.26058000326156616,0.5065400004386902,0.7095000147819519,0.43860000371932983,1.2400000095367432,0.5682880282402039,1.136335015296936,1.4193439483642578},
                        new const double[11]{ 0.22041000425815582,0.4798800051212311,0.5663700103759766,0.28178998827934265,0.5477700233459473,0.7672500014305115,0.47429999709129333,1.3329999446868896,0.6145439743995667,1.228827953338623,1.534872055053711},
                        new const double[11]{ 0.2370000034570694,0.515999972820282,0.609000027179718,0.30300000309944153,0.5889999866485596,0.824999988079071,0.5099999904632568,1.4259999990463257,0.6607999801635742,1.3213200569152832,1.6504000425338745},
                        new const double[11]{ 0.260699987411499,0.5676000118255615,0.6699000000953674,0.33329999446868896,0.6478999853134155,0.9075000286102295,0.5609999895095825,1.5499999523162842,0.7268800139427185,1.4534519910812378,1.815440058708191},
                        new const double[11]{ 0.2772899866104126,0.6037200093269348,0.7125300168991089,0.35451000928878784,0.6891300082206726,0.9652500152587891,0.5967000126838684,1.6430000066757202,0.7731360197067261,1.5459439754486084,1.9309680461883545},
                        new const double[11]{ 0.29624998569488525,0.6449999809265137,0.7612500190734863,0.3787499964237213,0.7362499833106995,1.03125,0.637499988079071,1.7359999418258667,0.8259999752044678,1.6516499519348145,2.062999963760376},
                        new const double[11]{ 0.32232001423835754,0.7017599940299988,0.8282399773597717,0.41207998991012573,0.80103999376297,1.121999979019165,0.6935999989509583,1.8600000143051147,0.898688018321991,1.7969950437545776,2.24454402923584},
                        new const double[11]{ 0.34839001297950745,0.7585200071334839,0.8952299952507019,0.44541001319885254,0.8658300042152405,1.21274995803833,0.7497000098228455,1.9839999675750732,0.9713760018348694,1.9423400163650513,2.4260880947113037},
                        new const double[11]{ 0.37446001172065735,0.815280020236969,0.9622200131416321,0.47874000668525696,0.930620014667511,1.3035000562667847,0.8058000206947327,2.1080000400543213,1.0440640449523926,2.087686061859131,2.6076319217681885},
                        new const double[11]{ 0.40290001034736633,0.8772000074386597,1.0353000164031982,0.5151000022888184,1.0012999773025513,1.402500033378601,0.8669999837875366,2.2320001125335693,1.12336003780365,2.246243953704834,2.8056800365448},
                        new const double[11]{ 0.4354870021343231,0.9481499791145325,1.1190370321273804,0.5567619800567627,1.0822880268096924,1.5159369707107544,0.937125027179718,2.360960006713867,1.2026560306549072,2.404802083969116,3.003727912902832},
                        new const double[11]{ 0.47380998730659485,1.03158700466156,1.2175129652023315,0.605758011341095,1.177528977394104,1.649340033531189,1.019592046737671,2.529599905014038,1.2819520235061646,2.5633609294891357,3.2017760276794434},
                        new const double[11]{ 0.512133002281189,1.1150239706039429,1.3159879446029663,0.6547530293464661,1.2727700471878052,1.7827420234680176,1.102059006690979,2.698240041732788,1.3612480163574219,2.721919059753418,3.3998239040374756},
                        new const double[11]{ 0.5504559874534607,1.1984620094299316,1.4144630432128906,0.7037479877471924,1.3680109977722168,1.9161449670791626,1.184525966644287,2.866879940032959,1.4405440092086792,2.8804779052734375,3.597872018814087},
                        new const double[11]{ 0.5922629833221436,1.2894840240478516,1.5218909978866577,0.7571970224380493,1.4719109535217285,2.0616750717163086,1.2744899988174438,3.035520076751709,1.5198400020599365,3.0390360355377197,3.795919895172119}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******高天之歌
             * 
             * 呼唤与诗和乐协鸣的风，将在尘泥中行走的事物送上高空吧。
             * 
             * **点按**
             * 在敌人所在的位置唤出风域，造成风元素范围伤害，并击飞其中的敌人。
             * 
             * **长按**
             * 以自身为中心，唤出更大的风域，造成风元素范围伤害，并击飞其中的敌人。
             * 长按施放后，温迪会乘风飞到空中。
             * 
             * 被高天之歌击飞的敌人，在短时间内会缓慢坠落。
             * 
             * 点按伤害|{param1:P}
             * 点按冷却时间|{param2:F1}秒
             * 长按伤害|{param3:P}
             * 长按冷却时间|{param4:F1}秒
            */
            void 温迪::E(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[4]{ 2.759999990463257,6,3.799999952316284,15},
                        new const double[4]{ 2.9670000076293945,6,4.085000038146973,15},
                        new const double[4]{ 3.1740000247955322,6,4.369999885559082,15},
                        new const double[4]{ 3.450000047683716,6,4.75,15},
                        new const double[4]{ 3.6570000648498535,6,5.034999847412109,15},
                        new const double[4]{ 3.864000082015991,6,5.320000171661377,15},
                        new const double[4]{ 4.139999866485596,6,5.699999809265137,15},
                        new const double[4]{ 4.415999889373779,6,6.079999923706055,15},
                        new const double[4]{ 4.691999912261963,6,6.460000038146973,15},
                        new const double[4]{ 4.9679999351501465,6,6.840000152587891,15},
                        new const double[4]{ 5.24399995803833,6,7.21999979019165,15},
                        new const double[4]{ 5.519999980926514,6,7.599999904632568,15},
                        new const double[4]{ 5.864999771118164,6,8.074999809265137,15},
                        new const double[4]{ 6.210000038146973,6,8.550000190734863,15},
                        new const double[4]{ 6.554999828338623,6,9.024999618530273,15}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******风神之诗
             * 
             * 射出千风汇聚而成的箭矢，在前方造出巨大的暴风之眼，将敌人卷入，持续造成风元素伤害。
             * 
             * **元素转化**
             * 若暴风之眼在技能持续期间接触了水元素/火元素/冰元素/雷元素，则会获得对应元素属性，额外造成该元素的附加伤害。
             * 元素转化在技能持续期间仅会发生一次。
             * 
             * 持续伤害|{param1:F1P}
             * 附加元素伤害|{param2:F1P}
             * 持续时间|{param3:F1}秒
             * 冷却时间|{param4:F1}秒
             * 元素能量|{param5:I}
            */
            void 温迪::Q(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[5]{ 0.37599998712539673,0.18799999356269836,8,15,60},
                        new const double[5]{ 0.4041999876499176,0.2020999938249588,8,15,60},
                        new const double[5]{ 0.4323999881744385,0.21619999408721924,8,15,60},
                        new const double[5]{ 0.4699999988079071,0.23499999940395355,8,15,60},
                        new const double[5]{ 0.498199999332428,0.249099999666214,8,15,60},
                        new const double[5]{ 0.5264000296592712,0.2632000148296356,8,15,60},
                        new const double[5]{ 0.5640000104904175,0.28200000524520874,8,15,60},
                        new const double[5]{ 0.6015999913215637,0.30079999566078186,8,15,60},
                        new const double[5]{ 0.63919997215271,0.319599986076355,8,15,60},
                        new const double[5]{ 0.676800012588501,0.3384000062942505,8,15,60},
                        new const double[5]{ 0.7143999934196472,0.3571999967098236,8,15,60},
                        new const double[5]{ 0.7519999742507935,0.37599998712539673,8,15,60},
                        new const double[5]{ 0.7990000247955322,0.3995000123977661,8,15,60},
                        new const double[5]{ 0.8460000157356262,0.4230000078678131,8,15,60},
                        new const double[5]{ 0.8930000066757202,0.4465000033378601,8,15,60}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };
        /*****温迪
        
            ***1命***
            弦发的苍风            
            ❤瞄准射击❤会额外发射两枚分裂箭，分别造成原本33%的伤害。
            
            ***2命***
            眷恋的泠风            
            ❤高天之歌❤会使敌人的风元素抗性与物理抗性降低12%，持续10秒。被❤高天之歌❤击飞的敌人在落地前，风元素抗性与物理抗性额外降低12%。
            
            ***3命***
            千风的诗篇            
            ❤风神之诗❤的技能等级提高3级。至多提升至15级。
            
            ***4命***
            自由的凛风            
            温迪获取元素晶球或元素微粒后，获得25%风元素伤害加成，持续10秒。
            
            ***5命***
            高天的协奏            
            ❤高天之歌❤的技能等级提高3级。至多提升至15级。
            
            ***6命***
            抗争的暴风            
            受❤风神之诗❤伤害的敌人，风元素抗性降低20%；若产生了元素转化，则使转换的元素抗性也降低20%。
            
        */
         
        