#pragma once
        #include "砂糖.h"
        using namespace DB::RoleConstruct;
        using namespace Atom;
        using namespace Atom::Enum;
        using namespace Advanced;
        using namespace Professional;
        //TODO:AUTO砂糖.cpp
        const double HP =  9243.677602744545;
        const double ATK =  169.91775205143585;
        const double DEF =  702.9971676649075;
        //风元素伤害加成
        const double OTHER = 0.23999999463558197;
        
        砂糖::~砂糖() {
        }
        砂糖::砂糖(u32* frameCur):Role(frameCur) {
            BaseObject* baseData = new BaseObject();
            static Attr
			* HelathAttr = new Attr(HP, 0., 0.),
			* AtkAttr = new Attr(ATK, 0., 0.),
			* DefAttr = new Attr(DEF, 0., 0.),
			* CritRateAttr = new Attr(0.05, 0., 0.),
			* CritDamageAttr = new Attr(0.5, 0., 0.);
            baseData->SetAttr((u32)AttrType::Helath, HelathAttr);
		    baseData->SetAttr((u32)AttrType::Atk, AtkAttr);
		    baseData->SetAttr((u32)AttrType::Def, DefAttr);
		    baseData->SetAttr((u32)AttrType::CritRate, CritRateAttr);
		    baseData->SetAttr((u32)AttrType::CritDamage, CritDamageAttr);
            this->rawCharacter = new Character(baseData, CharacterGender::Female, CharacterGroup::Tivat, ElementType::Anemo, WeaponType::Catalyst);
            delete baseData;
        };        

        /*
        
        ****1:触媒置换术
        ****************
        
            砂糖触发扩散反应时，使队伍中所有对应元素类型的角色（不包括砂糖自己）元素精通提升50，持续8秒。 

        ****************
        

        ****2:小小的慧风
        ****************
        
            ❤风灵作成·陆叁零捌❤或❤禁·风灵作成·柒伍同构贰型❤命中敌人时，基于砂糖元素精通的20%，为队伍中所有角色（不包括砂糖自己）提供元素精通加成，持续8秒。 

        ****************
        

        ****3:不稳定发现
        ****************
        
            合成角色与武器培养素材时，有10%概率获得2倍产出。 

        ****************
        
        */
        
            /*******普通攻击·简式风灵作成
             * 
             * **普通攻击**
             * 进行至多四段的风灵攻击，造成风元素伤害。
             * 
             * **重击**
             * 消耗一定体力，短暂咏唱后，造成风元素范围伤害。
             * 
             * **下落攻击**
             * 凝聚风灵的力量，从空中下坠冲击地面，攻击下落路径上的敌人，并在落地时造成风元素范围伤害。
             * 
             * 一段伤害|{param1:F1P}
             * 二段伤害|{param2:F1P}
             * 三段伤害|{param3:F1P}
             * 四段伤害|{param4:F1P}
             * 重击伤害|{param5:P}
             * 重击体力消耗|{param6:F1}点
             * 下坠期间伤害|{param7:F1P}
             * 低空/高空坠地冲击伤害|{param8:P}/{param9:P}
            */
            void 砂糖::A(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[9]{ 0.3346399962902069,0.30616000294685364,0.38447999954223633,0.47917601466178894,1.2015999555587769,50,0.5682880282402039,1.136335015296936,1.4193439483642578},
                        new const double[9]{ 0.35973799228668213,0.32912200689315796,0.413316011428833,0.5151140093803406,1.2917200326919556,50,0.6145439743995667,1.228827953338623,1.534872055053711},
                        new const double[9]{ 0.38483598828315735,0.3520840108394623,0.4421519935131073,0.5510519742965698,1.3818399906158447,50,0.6607999801635742,1.3213200569152832,1.6504000425338745},
                        new const double[9]{ 0.41830000281333923,0.38269999623298645,0.4805999994277954,0.5989699959754944,1.5019999742507935,50,0.7268800139427185,1.4534519910812378,1.815440058708191},
                        new const double[9]{ 0.44339799880981445,0.40566200017929077,0.5094360113143921,0.6349080204963684,1.5921200513839722,50,0.7731360197067261,1.5459439754486084,1.9309680461883545},
                        new const double[9]{ 0.4684959948062897,0.4286240041255951,0.5382720232009888,0.6708459854125977,1.6822400093078613,50,0.8259999752044678,1.6516499519348145,2.062999963760376},
                        new const double[9]{ 0.5019599795341492,0.45923998951911926,0.5767199993133545,0.7187640070915222,1.80239999294281,50,0.898688018321991,1.7969950437545776,2.24454402923584},
                        new const double[9]{ 0.535423994064331,0.4898560047149658,0.6151679754257202,0.7666820287704468,1.9225599765777588,50,0.9713760018348694,1.9423400163650513,2.4260880947113037},
                        new const double[9]{ 0.5688880085945129,0.52047199010849,0.6536160111427307,0.8145989775657654,2.042720079421997,50,1.0440640449523926,2.087686061859131,2.6076319217681885},
                        new const double[9]{ 0.6023520231246948,0.5510879755020142,0.6920639872550964,0.8625169992446899,2.1628799438476562,50,1.12336003780365,2.246243953704834,2.8056800365448},
                        new const double[9]{ 0.6358159780502319,0.5817040205001831,0.7305120229721069,0.9104340076446533,2.2830400466918945,50,1.2026560306549072,2.404802083969116,3.003727912902832},
                        new const double[9]{ 0.6692799925804138,0.6123200058937073,0.7689599990844727,0.9583520293235779,2.4031999111175537,50,1.2819520235061646,2.5633609294891357,3.2017760276794434},
                        new const double[9]{ 0.71110999584198,0.6505900025367737,0.8170199990272522,1.0182490348815918,2.5534000396728516,50,1.3612480163574219,2.721919059753418,3.3998239040374756},
                        new const double[9]{ 0.7529399991035461,0.6888599991798401,0.8650799989700317,1.078145980834961,2.7035999298095703,50,1.4405440092086792,2.8804779052734375,3.597872018814087},
                        new const double[9]{ 0.7947700023651123,0.7271299958229065,0.9131399989128113,1.1380430459976196,2.853800058364868,50,1.5198400020599365,3.0390360355377197,3.795919895172119}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******风灵作成·陆叁零捌
             * 
             * 召唤出小型风灵，将敌人与物体牵引至风灵所在位置，击飞范围内的敌人，并造成风元素伤害。
             * 
             * 技能伤害|{param1:P}
             * 冷却时间|{param2:F1}秒
            */
            void 砂糖::E(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[2]{ 2.111999988555908,15},
                        new const double[2]{ 2.270400047302246,15},
                        new const double[2]{ 2.428800106048584,15},
                        new const double[2]{ 2.640000104904175,15},
                        new const double[2]{ 2.7983999252319336,15},
                        new const double[2]{ 2.9567999839782715,15},
                        new const double[2]{ 3.1679999828338623,15},
                        new const double[2]{ 3.379199981689453,15},
                        new const double[2]{ 3.590399980545044,15},
                        new const double[2]{ 3.8015999794006348,15},
                        new const double[2]{ 4.012800216674805,15},
                        new const double[2]{ 4.223999977111816,15},
                        new const double[2]{ 4.48799991607666,15},
                        new const double[2]{ 4.751999855041504,15},
                        new const double[2]{ 5.015999794006348,15}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******禁·风灵作成·柒伍同构贰型
             * 
             * 砂糖抛出不稳定的烧瓶，生成大型风灵。
             * 存在期间，大型风灵会持续牵引附近的敌人与物体，击飞附近的敌人，并造成风元素伤害。
             * 
             * **元素转化**
             * 若风灵在技能持续期间接触了水元素/火元素/冰元素/雷元素，则会获得对应元素属性，额外造成该元素的附加伤害。
             * 元素转化在技能持续期间仅会发生一次。
             * 
             * 持续伤害|{param1:P}
             * 附加元素伤害|{param2:F1P}
             * 持续时间|{param3:F1}秒
             * 冷却时间|{param4:F1}秒
             * 元素能量|{param5:I}
            */
            void 砂糖::Q(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[5]{ 1.4800000190734863,0.4399999976158142,6,20,80},
                        new const double[5]{ 1.590999960899353,0.4729999899864197,6,20,80},
                        new const double[5]{ 1.7020000219345093,0.5059999823570251,6,20,80},
                        new const double[5]{ 1.850000023841858,0.550000011920929,6,20,80},
                        new const double[5]{ 1.9609999656677246,0.5830000042915344,6,20,80},
                        new const double[5]{ 2.072000026702881,0.6159999966621399,6,20,80},
                        new const double[5]{ 2.2200000286102295,0.6600000262260437,6,20,80},
                        new const double[5]{ 2.368000030517578,0.7039999961853027,6,20,80},
                        new const double[5]{ 2.5160000324249268,0.7480000257492065,6,20,80},
                        new const double[5]{ 2.6640000343322754,0.7919999957084656,6,20,80},
                        new const double[5]{ 2.812000036239624,0.8360000252723694,6,20,80},
                        new const double[5]{ 2.9600000381469727,0.8799999952316284,6,20,80},
                        new const double[5]{ 3.1449999809265137,0.9350000023841858,6,20,80},
                        new const double[5]{ 3.3299999237060547,0.9900000095367432,6,20,80},
                        new const double[5]{ 3.515000104904175,1.0449999570846558,6,20,80}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };
        /*****砂糖
        
            ***1命***
            堆叠真空域            
            ❤风灵作成·陆叁零捌❤的可使用次数增加1次。
            
            ***2命***
            不羁型贝特            
            ❤禁·风灵作成·柒伍同构贰型❤的技能持续时间延长2秒。
            
            ***3命***
            零失误少女            
            ❤风灵作成·陆叁零捌❤的技能等级提高3级。至多提升至15级。
            
            ***4命***
            炼金的偏执            
            砂糖的普通攻击或者重击累计命中敌人7次，❤风灵作成·陆叁零捌❤的冷却时间就会随机减少1-7秒。每0.1秒至多计数一次。
            
            ***5命***
            认真普通瓶            
            ❤禁·风灵作成·柒伍同构贰型❤的技能等级提高3级。至多提升至15级。
            
            ***6命***
            混元熵增论            
            ❤禁·风灵作成·柒伍同构贰型❤如果发生了元素转化，则使队伍中所有角色在技能持续时间内获得20%的对应元素伤害加成。
            
        */
         
        