#pragma once
        #include "魈.h"
        using namespace DB::RoleConstruct;
        using namespace Atom;
        using namespace Atom::Enum;
        using namespace Advanced;
        using namespace Professional;
        //TODO:AUTO魈.cpp
        const double HP =  12735.747672248981;
        const double ATK =  349.2004441320678;
        const double DEF =  799.2965799245794;
        //暴击率
        const double OTHER = 0.2420000024139881;
        
        魈::~魈() {
        }
        魈::魈(u32* frameCur):Role(frameCur) {
            BaseObject* baseData = new BaseObject();
            static Attr
			* HelathAttr = new Attr(HP, 0., 0.),
			* AtkAttr = new Attr(ATK, 0., 0.),
			* DefAttr = new Attr(DEF, 0., 0.),
			* CritRateAttr = new Attr(0.05, 0., 0.),
			* CritDamageAttr = new Attr(0.5, 0., 0.);
            baseData->SetAttr((u32)AttrType::Helath, HelathAttr);
		    baseData->SetAttr((u32)AttrType::Atk, AtkAttr);
		    baseData->SetAttr((u32)AttrType::Def, DefAttr);
		    baseData->SetAttr((u32)AttrType::CritRate, CritRateAttr);
		    baseData->SetAttr((u32)AttrType::CritDamage, CritDamageAttr);
            this->rawCharacter = new Character(baseData, CharacterGender::Male, CharacterGroup::Tivat, ElementType::Anemo, WeaponType::Polearm);
            delete baseData;
        };        

        /*
        
        ****1:降魔·平妖大圣
        ****************
        
            在❤靖妖傩舞❤状态下，魈造成的所有伤害提高5%。此后，在技能持续时间内，每经过3秒，造成的伤害再额外提高5%。
            至多获得25%伤害加成。 

        ****************
        

        ****2:坏劫·国土碾尘
        ****************
        
            施放❤风轮两立❤会使之后7秒内的风轮两立造成的伤害提高15%。
            该效果持续7秒，最多叠加3次，叠加时刷新持续时间。 

        ****************
        

        ****3:神通·空中自在法
        ****************
        
            队伍中自己的角色攀爬消耗的体力降低20%。
            无法与效果完全相同的固有天赋叠加。 

        ****************
        
        */
        
            /*******普通攻击·卷积微尘
             * 
             * **普通攻击**
             * 进行至多六段的连续枪击。
             * 
             * **重击**
             * 消耗一定体力，进行上挑攻击。
             * 
             * **下落攻击**
             * 从空中下坠冲击地面，攻击下落路径上的敌人，并在落地时造成范围伤害。
             * 魈进行下落攻击时，不会承受坠落伤害。
             * 
             * 一段伤害|{param1:F1P}+{param2:F1P}
             * 二段伤害|{param3:F1P}
             * 三段伤害|{param4:F1P}
             * 四段伤害|{param5:F1P}+{param6:F1P}
             * 五段伤害|{param7:F1P}
             * 六段伤害|{param8:F1P}
             * 重击伤害|{param9:P}
             * 重击体力消耗|{param10:F1}点
             * 下坠期间伤害|{param11:P}
             * 低空/高空坠地冲击伤害|{param12:P}/{param13:P}
            */
            void 魈::A(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[13]{ 0.2754400074481964,0.2754400074481964,0.5693600177764893,0.6855199933052063,0.3766399919986725,0.3766399919986725,0.7154399752616882,0.9583200216293335,1.2108800411224365,25,0.8183349967002869,1.6363229751586914,2.0438549518585205},
                        new const double[13]{ 0.2942200005054474,0.2942200005054474,0.6081799864768982,0.73225998878479,0.402319997549057,0.402319997549057,0.7642199993133545,1.0236599445343018,1.2934399843215942,25,0.8849430084228516,1.7695120573043823,2.2102160453796387},
                        new const double[13]{ 0.31299999356269836,0.31299999356269836,0.6470000147819519,0.7789999842643738,0.42800000309944153,0.42800000309944153,0.8130000233650208,1.0889999866485596,1.3760000467300415,25,0.9515519738197327,1.9027010202407837,2.3765759468078613},
                        new const double[13]{ 0.33803999423980713,0.33803999423980713,0.6987599730491638,0.8413199782371521,0.4622400104999542,0.4622400104999542,0.8780400156974792,1.1761200428009033,1.4860800504684448,25,1.046707034111023,2.092971086502075,2.61423397064209},
                        new const double[13]{ 0.3568199872970581,0.3568199872970581,0.7375800013542175,0.8880599737167358,0.48791998624801636,0.48791998624801636,0.9268199801445007,1.2414599657058716,1.5686399936676025,25,1.1133160591125488,2.2261600494384766,2.7805941104888916},
                        new const double[13]{ 0.37872999906539917,0.37872999906539917,0.7828699946403503,0.9425899982452393,0.5178800225257874,0.5178800225257874,0.9837300181388855,1.3176900148391724,1.6649600267410278,25,1.1894400119781494,2.378376007080078,2.970720052719116},
                        new const double[13]{ 0.40689998865127563,0.40689998865127563,0.8410999774932861,1.0126999616622925,0.5564000010490417,0.5564000010490417,1.0569000244140625,1.4156999588012695,1.7888000011444092,25,1.2941110134124756,2.5876729488372803,3.232142925262451},
                        new const double[13]{ 0.4350700080394745,0.4350700080394745,0.8993300199508667,1.0828100442886353,0.5949199795722961,0.5949199795722961,1.1300699710845947,1.5137100219726562,1.9126399755477905,25,1.3987809419631958,2.7969698905944824,3.4935669898986816},
                        new const double[13]{ 0.46323999762535095,0.46323999762535095,0.9575600028038025,1.1529200077056885,0.6334400177001953,0.6334400177001953,1.2032400369644165,1.6117199659347534,2.036479949951172,25,1.503451943397522,3.0062670707702637,3.7549901008605957},
                        new const double[13]{ 0.4914099872112274,0.4914099872112274,1.0157899856567383,1.2230299711227417,0.6719599962234497,0.6719599962234497,1.2764099836349487,1.7097300291061401,2.1603200435638428,25,1.6176379919052124,3.234591007232666,4.0401787757873535},
                        new const double[13]{ 0.5195800065994263,0.5195800065994263,1.0740200281143188,1.2931400537490845,0.7104799747467041,0.7104799747467041,1.3495800495147705,1.8077399730682373,2.2841598987579346,25,1.7318249940872192,3.4629149436950684,4.3253679275512695},
                        new const double[13]{ 0.5477499961853027,0.5477499961853027,1.1322499513626099,1.3632500171661377,0.7490000128746033,0.7490000128746033,1.4227499961853027,1.905750036239624,2.4079999923706055,25,1.8460110425949097,3.691240072250366,4.6105570793151855},
                        new const double[13]{ 0.5759199857711792,0.5759199857711792,1.1904799938201904,1.433359980583191,0.7875199913978577,0.7875199913978577,1.495919942855835,2.0037600994110107,2.5318400859832764,25,1.9601969718933105,3.9195640087127686,4.895747184753418},
                        new const double[13]{ 0.6040899753570557,0.6040899753570557,1.248710036277771,1.5034699440002441,0.8260400295257568,0.8260400295257568,1.5690900087356567,2.1017699241638184,2.655679941177368,25,2.074383020401001,4.14788818359375,5.180935859680176},
                        new const double[13]{ 0.6322600245475769,0.6322600245475769,1.306939959526062,1.573580026626587,0.8645600080490112,0.8645600080490112,1.642259955406189,2.199779987335205,2.779520034790039,25,2.188570022583008,4.376212120056152,5.466125011444092}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******风轮两立
             * 
             * 疾速突进，对路径上的敌人造成风元素伤害。
             * 可以在空中施放。
             * 初始拥有2次可使用次数。
             * 
             * 技能伤害|{param1:P}
             * 冷却时间|{param2:F1}秒
            */
            void 魈::E(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[2]{ 2.5280001163482666,10},
                        new const double[2]{ 2.717600107192993,10},
                        new const double[2]{ 2.9072000980377197,10},
                        new const double[2]{ 3.1600000858306885,10},
                        new const double[2]{ 3.349600076675415,10},
                        new const double[2]{ 3.5392000675201416,10},
                        new const double[2]{ 3.7920000553131104,10},
                        new const double[2]{ 4.0447998046875,10},
                        new const double[2]{ 4.297599792480469,10},
                        new const double[2]{ 4.5503997802734375,10},
                        new const double[2]{ 4.803199768066406,10},
                        new const double[2]{ 5.056000232696533,10},
                        new const double[2]{ 5.372000217437744,10},
                        new const double[2]{ 5.688000202178955,10},
                        new const double[2]{ 6.004000186920166,10}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******靖妖傩舞
             * 
             * 展现数千年前令神魔精妖睹之胆颤的夜叉傩面。
             * 
             * **夜叉傩面**
             * ·大幅提升魈的跳跃能力；
             * ·提高攻击范围与攻击伤害；
             * ·将攻击伤害转为风元素伤害，该元素转化无法被附魔覆盖。
             * 
             * 在这个状态下，魈会持续损失生命值。
             * 效果将在魈退场时解除。
             * 
             * 普通攻击/重击/下落攻击伤害提升|{param1:F1P}
             * 生命流失|每秒{param2:F1P}当前生命值
             * 持续时间|{param3:F1}秒
             * 冷却时间|{param4:F1}秒
             * 元素能量|{param5:I}
            */
            void 魈::Q(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[5]{ 0.5845000147819519,0.029999999329447746,15,18,70},
                        new const double[5]{ 0.6194999814033508,0.029999999329447746,15,18,70},
                        new const double[5]{ 0.6545000076293945,0.029999999329447746,15,18,70},
                        new const double[5]{ 0.699999988079071,0.02500000037252903,15,18,70},
                        new const double[5]{ 0.7350000143051147,0.02500000037252903,15,18,70},
                        new const double[5]{ 0.7699999809265137,0.02500000037252903,15,18,70},
                        new const double[5]{ 0.815500020980835,0.019999999552965164,15,18,70},
                        new const double[5]{ 0.8610000014305115,0.019999999552965164,15,18,70},
                        new const double[5]{ 0.906499981880188,0.019999999552965164,15,18,70},
                        new const double[5]{ 0.9520000219345093,0.019999999552965164,15,18,70},
                        new const double[5]{ 0.9975000023841858,0.019999999552965164,15,18,70},
                        new const double[5]{ 1.0429999828338623,0.019999999552965164,15,18,70},
                        new const double[5]{ 1.0885000228881836,0.019999999552965164,15,18,70},
                        new const double[5]{ 1.1339999437332153,0.019999999552965164,15,18,70},
                        new const double[5]{ 1.1794999837875366,0.019999999552965164,15,18,70}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };
        /*****魈
        
            ***1命***
            坏劫·毁坏三界            
            ❤风轮两立❤的可使用次数增加1次。
            
            ***2命***
            空劫·虚空华开敷变            
            处于队伍后台时，魈自己的元素充能效率提高25%。
            
            ***3命***
            降魔·忿怒显相            
            ❤风轮两立❤的技能等级提高3级。至多提升至15级。
            
            ***4命***
            神通·诸苦灭尽            
            魈的生命值低于50%时，获得100%防御力提升。
            
            ***5命***
            成劫·无明增长            
            ❤靖妖傩舞❤的技能等级提高3级。至多提升至15级。
            
            ***6命***
            降魔·护法夜叉            
            在❤靖妖傩舞❤状态下，下落攻击命中至少2个敌人时，❤风轮两立❤立刻获得1次可使用次数，并且在接下来1秒内，可以无视冷却时间施放风轮两立。
            
        */
         
        