#pragma once
        #include "五郎.h"
        using namespace DB::RoleConstruct;
        using namespace Atom;
        using namespace Atom::Enum;
        using namespace Advanced;
        using namespace Professional;
        //TODO:AUTO五郎.cpp
        const double HP =  9569.92523615167;
        const double ATK =  182.6615890659741;
        const double DEF =  648.3954482758236;
        //岩元素伤害加成
        const double OTHER = 0.23999999463558197;
        
        五郎::~五郎() {
        }
        五郎::五郎(u32* frameCur):Role(frameCur) {
            BaseObject* baseData = new BaseObject();
            static Attr
			* HelathAttr = new Attr(HP, 0., 0.),
			* AtkAttr = new Attr(ATK, 0., 0.),
			* DefAttr = new Attr(DEF, 0., 0.),
			* CritRateAttr = new Attr(0.05, 0., 0.),
			* CritDamageAttr = new Attr(0.5, 0., 0.);
            baseData->SetAttr((u32)AttrType::Helath, HelathAttr);
		    baseData->SetAttr((u32)AttrType::Atk, AtkAttr);
		    baseData->SetAttr((u32)AttrType::Def, DefAttr);
		    baseData->SetAttr((u32)AttrType::CritRate, CritRateAttr);
		    baseData->SetAttr((u32)AttrType::CritDamage, CritDamageAttr);
            this->rawCharacter = new Character(baseData, CharacterGender::Male, CharacterGroup::Tivat, ElementType::Geo, WeaponType::Bow);
            delete baseData;
        };        

        /*
        
        ****1:不畏风雨
        ****************
        
            施放❤兽牙逐突形胜战法❤后的12秒内，附近的队伍中所有角色的防御力提升25%。 

        ****************
        

        ****2:报恩之守
        ****************
        
            基于防御力，五郎的以下攻击造成的伤害提高：
            ·❤犬坂吠吠方圆阵❤的技能伤害提高值：防御力的156%；
            ·❤兽牙逐突形胜战法❤的技能伤害与岩晶崩破伤害提高值：防御力的15.6%。 

        ****************
        

        ****3:亮晶晶发现术
        ****************
        
            在小地图上显示周围的❤稻妻区域特产❤的位置。 

        ****************
        
        */
        
            /*******普通攻击·呲牙裂扇箭
             * 
             * **普通攻击**
             * 进行至多四段的连续弓箭射击。
             * 
             * **重击**
             * 进行伤害更高、更为精准的**瞄准射击**。
             * 瞄准时，岩晶会在箭矢上持续积聚。聚满了晶岩的箭矢会造成岩元素伤害。
             * 
             * **下落攻击**
             * 从空中射出箭雨，并迅速下坠冲击地面，在落地时造成范围伤害。
             * 
             * 一段伤害|{param1:F1P}
             * 二段伤害|{param2:F1P}
             * 三段伤害|{param3:F1P}
             * 四段伤害|{param4:F1P}
             * 瞄准射击|{param5:F1P}
             * 满蓄力瞄准射击|{param6:P}
             * 下坠期间伤害|{param7:F1P}
             * 低空/高空坠地冲击伤害|{param8:P}/{param9:P}
            */
            void 五郎::A(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[9]{ 0.3775399923324585,0.3715200126171112,0.4945000112056732,0.589959979057312,0.43860000371932983,1.2400000095367432,0.5682880282402039,1.136335015296936,1.4193439483642578},
                        new const double[9]{ 0.408270001411438,0.4017600119113922,0.5347499847412109,0.6379799842834473,0.47429999709129333,1.3329999446868896,0.6145439743995667,1.228827953338623,1.534872055053711},
                        new const double[9]{ 0.4390000104904175,0.4320000112056732,0.574999988079071,0.6859999895095825,0.5099999904632568,1.4259999990463257,0.6607999801635742,1.3213200569152832,1.6504000425338745},
                        new const double[9]{ 0.4828999936580658,0.47519999742507935,0.6324999928474426,0.7545999884605408,0.5609999895095825,1.5499999523162842,0.7268800139427185,1.4534519910812378,1.815440058708191},
                        new const double[9]{ 0.5136299729347229,0.5054399967193604,0.6727499961853027,0.802619993686676,0.5967000126838684,1.6430000066757202,0.7731360197067261,1.5459439754486084,1.9309680461883545},
                        new const double[9]{ 0.5487499833106995,0.5400000214576721,0.71875,0.8575000166893005,0.637499988079071,1.7359999418258667,0.8259999752044678,1.6516499519348145,2.062999963760376},
                        new const double[9]{ 0.5970399975776672,0.5875200033187866,0.7820000052452087,0.9329599738121033,0.6935999989509583,1.8600000143051147,0.898688018321991,1.7969950437545776,2.24454402923584},
                        new const double[9]{ 0.645330011844635,0.6350399851799011,0.8452500104904175,1.0084199905395508,0.7497000098228455,1.9839999675750732,0.9713760018348694,1.9423400163650513,2.4260880947113037},
                        new const double[9]{ 0.6936200261116028,0.6825600266456604,0.9085000157356262,1.0838799476623535,0.8058000206947327,2.1080000400543213,1.0440640449523926,2.087686061859131,2.6076319217681885},
                        new const double[9]{ 0.7462999820709229,0.7343999743461609,0.9775000214576721,1.166200041770935,0.8669999837875366,2.2320001125335693,1.12336003780365,2.246243953704834,2.8056800365448},
                        new const double[9]{ 0.7989799976348877,0.7862399816513062,1.0464999675750732,1.248520016670227,0.9282000064849854,2.3559999465942383,1.2026560306549072,2.404802083969116,3.003727912902832},
                        new const double[9]{ 0.8516600131988525,0.8380799889564514,1.1154999732971191,1.330839991569519,0.9894000291824341,2.4800000190734863,1.2819520235061646,2.5633609294891357,3.2017760276794434},
                        new const double[9]{ 0.9043400287628174,0.8899199962615967,1.184499979019165,1.413159966468811,1.0506000518798828,2.634999990463257,1.3612480163574219,2.721919059753418,3.3998239040374756},
                        new const double[9]{ 0.9570199847221375,0.9417600035667419,1.253499984741211,1.495479941368103,1.111799955368042,2.7899999618530273,1.4405440092086792,2.8804779052734375,3.597872018814087},
                        new const double[9]{ 1.0096999406814575,0.9936000108718872,1.3224999904632568,1.5778000354766846,1.1729999780654907,2.944999933242798,1.5198400020599365,3.0390360355377197,3.795919895172119}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******犬坂吠吠方圆阵
             * 
             * 造成岩元素范围伤害，并立起大将旗指物。
             * 
             * **大将旗指物**
             * 依据施放时队伍中元素类型为岩元素的角色数量，为其领域内的当前场上角色赋予如下效果：
             * ·一名角色时：「坚牢」：防御力提升；
             * ·二名角色时：「难破」：除上述效果外，提升抗打断能力；
             * ·三名角色时：「摧碎」：除上述效果外，获得岩元素伤害加成。
             * 
             * 同时只能存在一个由五郎自己创造的大将旗指物；角色只能获得一个大将旗指物提供的效果。角色离开领域后，领域的效果将持续2秒。
             * 
             * **长按**
             * 可以调整技能生效位置。
             * 
             * 技能伤害|{param1:F1P}
             * 防御力提升|{param2:I}
             * 岩元素伤害加成|{param3:P}
             * 持续时间|{param4:F1}秒
             * 冷却时间|{param5:F1}秒
            */
            void 五郎::E(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[5]{ 1.0720000267028809,206.16000366210938,0.15000000596046448,10,10},
                        new const double[5]{ 1.152400016784668,221.6219940185547,0.15000000596046448,10,10},
                        new const double[5]{ 1.232800006866455,237.08399963378906,0.15000000596046448,10,10},
                        new const double[5]{ 1.340000033378601,257.70001220703125,0.15000000596046448,10,10},
                        new const double[5]{ 1.4204000234603882,273.1619873046875,0.15000000596046448,10,10},
                        new const double[5]{ 1.5008000135421753,288.6239929199219,0.15000000596046448,10,10},
                        new const double[5]{ 1.6080000400543213,309.239990234375,0.15000000596046448,10,10},
                        new const double[5]{ 1.7151999473571777,329.8559875488281,0.15000000596046448,10,10},
                        new const double[5]{ 1.8223999738693237,350.47198486328125,0.15000000596046448,10,10},
                        new const double[5]{ 1.9296000003814697,371.0880126953125,0.15000000596046448,10,10},
                        new const double[5]{ 2.036799907684326,391.7040100097656,0.15000000596046448,10,10},
                        new const double[5]{ 2.1440000534057617,412.32000732421875,0.15000000596046448,10,10},
                        new const double[5]{ 2.2780001163482666,438.0899963378906,0.15000000596046448,10,10},
                        new const double[5]{ 2.4119999408721924,463.8599853515625,0.15000000596046448,10,10},
                        new const double[5]{ 2.5460000038146973,489.6300048828125,0.15000000596046448,10,10}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******兽牙逐突形胜战法
             * 
             * 展现大将之威，造成岩元素范围伤害，并展开大将威仪之领域，鼓舞身边的战友。
             * 
             * **大将威仪**
             * 具有如下特性：
             * ·领域拥有等同于元素战技「犬坂吠吠方圆阵」创造的大将旗指物的效果，依据施放时队伍中元素类型为岩元素的角色数量，为其领域内的当前场上角色赋予效果，并且会随着当前场上角色移动；
             * ·每1.5秒，会产生一次岩晶崩破，对领域内一名敌人造成岩元素范围伤害；
             * ·每1.5秒，将领域内1枚结晶反应产生的晶片吸引至当前角色的位置。
             * 
             * 施放时，若场上存在五郎自己的大将旗指物，会将其破坏。此外，在大将威仪的持续期间，五郎自己施放元素战技「犬坂吠吠方圆阵」时，将不会产生大将旗指物。
             * 五郎倒下时将解除五郎自己的大将威仪效果。
             * 
             * 技能伤害|{param1:P}防御力
             * 岩晶崩破伤害|{param2:P}防御力
             * 持续时间|{param3:F1}秒
             * 冷却时间|{param4:F1}秒
             * 元素能量|{param5:I}
            */
            void 五郎::Q(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[5]{ 0.9821599721908569,0.6129999756813049,9,20,80},
                        new const double[5]{ 1.0558220148086548,0.6589750051498413,9,20,80},
                        new const double[5]{ 1.1294840574264526,0.7049499750137329,9,20,80},
                        new const double[5]{ 1.2276999950408936,0.7662500143051147,9,20,80},
                        new const double[5]{ 1.3013620376586914,0.8122249841690063,9,20,80},
                        new const double[5]{ 1.3750239610671997,0.8582000136375427,9,20,80},
                        new const double[5]{ 1.4732400178909302,0.9194999933242798,9,20,80},
                        new const double[5]{ 1.571455955505371,0.9807999730110168,9,20,80},
                        new const double[5]{ 1.6696720123291016,1.042099952697754,9,20,80},
                        new const double[5]{ 1.7678879499435425,1.1033999919891357,9,20,80},
                        new const double[5]{ 1.866104006767273,1.1647000312805176,9,20,80},
                        new const double[5]{ 1.9643199443817139,1.2259999513626099,9,20,80},
                        new const double[5]{ 2.087090015411377,1.3026249408721924,9,20,80},
                        new const double[5]{ 2.20986008644104,1.3792500495910645,9,20,80},
                        new const double[5]{ 2.332629919052124,1.455875039100647,9,20,80}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };
        /*****五郎
        
            ***1命***
            犬奔·疾如风            
            处于五郎自己的❤大将旗指物❤或❤大将威仪❤领域中的当前场上角色（除了五郎自己）对敌人造成岩元素伤害后，五郎自己的❤犬坂吠吠方圆阵❤冷却时间减少2秒。该效果每10秒至多触发一次。
            
            ***2命***
            犬坐·稳如钟            
            在❤大将威仪❤的持续期间，附近的当前场上角色获取结晶反应产生的晶片后，五郎自己的大将威仪的持续时间延长1秒。该效果每0.1秒至多触发一次，至多通过这种方式延长3秒持续时间。
            
            ***3命***
            犬爪·势如火            
            ❤犬坂吠吠方圆阵❤的技能等级提高3级。至多提升至15级。
            
            ***4命***
            犬舐·温如水            
            ❤大将威仪❤在具有「难破」或「摧碎」的效果时，每1.5秒，为领域内的当前场上角色恢复生命值，回复量相当于五郎自己防御力的50%。
            
            ***5命***
            犬突·动如雷            
            ❤兽牙逐突形胜战法❤的技能等级提高3级。至多提升至15级。
            
            ***6命***
            犬勇·忠如山            
            施放❤犬坂吠吠方圆阵❤或❤兽牙逐突形胜战法❤后的12秒内，依据施放时的领域等级，提高附近的队伍中所有角色岩元素伤害的暴击伤害：·「坚牢」：提高10%；·「难破」：提高20%；·「摧碎」：提高40%。该效果无法叠加，以后生效的为准。
            
        */
         
        