#pragma once
        #include "凝光.h"
        using namespace DB::RoleConstruct;
        using namespace Atom;
        using namespace Atom::Enum;
        using namespace Advanced;
        using namespace Professional;
        //TODO:AUTO凝光.cpp
        const double HP =  9787.423311600985;
        const double ATK =  212.39719698963927;
        const double DEF =  573.318087431282;
        //岩元素伤害加成
        const double OTHER = 0.23999999463558197;
        
        凝光::~凝光() {
        }
        凝光::凝光(u32* frameCur):Role(frameCur) {
            BaseObject* baseData = new BaseObject();
            static Attr
			* HelathAttr = new Attr(HP, 0., 0.),
			* AtkAttr = new Attr(ATK, 0., 0.),
			* DefAttr = new Attr(DEF, 0., 0.),
			* CritRateAttr = new Attr(0.05, 0., 0.),
			* CritDamageAttr = new Attr(0.5, 0., 0.);
            baseData->SetAttr((u32)AttrType::Helath, HelathAttr);
		    baseData->SetAttr((u32)AttrType::Atk, AtkAttr);
		    baseData->SetAttr((u32)AttrType::Def, DefAttr);
		    baseData->SetAttr((u32)AttrType::CritRate, CritRateAttr);
		    baseData->SetAttr((u32)AttrType::CritDamage, CritDamageAttr);
            this->rawCharacter = new Character(baseData, CharacterGender::Female, CharacterGroup::Tivat, ElementType::Geo, WeaponType::Catalyst);
            delete baseData;
        };        

        /*
        
        ****1:星移势转
        ****************
        
            拥有星璇时，凝光的重击不会消耗体力。 

        ****************
        

        ****2:储之千日，用之一刻
        ****************
        
            穿过❤璇玑屏❤的角色会获得12%岩元素伤害加成，持续10秒。 

        ****************
        

        ****3:奇石珠宝录
        ****************
        
            在小地图上显示周围能产出❤锻造用矿石的矿脉❤位置。 

        ****************
        
        */
        
            /*******普通攻击·千金掷
             * 
             * **普通攻击**
             * 发射宝石，造成岩元素伤害。
             * 命中时，赋予凝光一枚星璇。
             * 
             * **重击**
             * 消耗体力，发射一颗巨型宝石，造成岩元素伤害。
             * 若凝光拥有星璇，施放重击时会将所有星璇一同发射，造成额外的伤害。
             * 
             * **下落攻击**
             * 凝聚晶岩的力量，从空中下坠冲击地面，攻击下落路径上的敌人，并在落地时造成岩元素范围伤害。
             * 
             * 普通攻击伤害|{param1:F1P}
             * 重击伤害|{param2:P}
             * 星璇伤害|每个{param3:F1P}
             * 重击体力消耗|{param4:F1}点
             * 下坠期间伤害|{param5:F1P}
             * 低空/高空坠地冲击伤害|{param6:P}/{param7:P}
            */
            void 凝光::A(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[7]{ 0.2800000011920929,1.7408000230789185,0.4959999918937683,50,0.5682880282402039,1.136335015296936,1.4193439483642578},
                        new const double[7]{ 0.3009999990463257,1.871359944343567,0.5332000255584717,50,0.6145439743995667,1.228827953338623,1.534872055053711},
                        new const double[7]{ 0.32199999690055847,2.001919984817505,0.5703999996185303,50,0.6607999801635742,1.3213200569152832,1.6504000425338745},
                        new const double[7]{ 0.3499999940395355,2.1760001182556152,0.6200000047683716,50,0.7268800139427185,1.4534519910812378,1.815440058708191},
                        new const double[7]{ 0.3709999918937683,2.3065600395202637,0.6571999788284302,50,0.7731360197067261,1.5459439754486084,1.9309680461883545},
                        new const double[7]{ 0.3919999897480011,2.437119960784912,0.6944000124931335,50,0.8259999752044678,1.6516499519348145,2.062999963760376},
                        new const double[7]{ 0.41999998688697815,2.6112000942230225,0.7440000176429749,50,0.898688018321991,1.7969950437545776,2.24454402923584},
                        new const double[7]{ 0.4480000138282776,2.7852799892425537,0.7936000227928162,50,0.9713760018348694,1.9423400163650513,2.4260880947113037},
                        new const double[7]{ 0.47600001096725464,2.959359884262085,0.8432000279426575,50,1.0440640449523926,2.087686061859131,2.6076319217681885},
                        new const double[7]{ 0.5040000081062317,3.1334400177001953,0.892799973487854,50,1.12336003780365,2.246243953704834,2.8056800365448},
                        new const double[7]{ 0.5331199765205383,3.3144829273223877,0.944383978843689,50,1.2026560306549072,2.404802083969116,3.003727912902832},
                        new const double[7]{ 0.5712000131607056,3.551232099533081,1.0118399858474731,50,1.2819520235061646,2.5633609294891357,3.2017760276794434},
                        new const double[7]{ 0.609279990196228,3.7879810333251953,1.0792959928512573,50,1.3612480163574219,2.721919059753418,3.3998239040374756},
                        new const double[7]{ 0.6473600268363953,4.024730205535889,1.1467519998550415,50,1.4405440092086792,2.8804779052734375,3.597872018814087},
                        new const double[7]{ 0.6854400038719177,4.261477947235107,1.2142080068588257,50,1.5198400020599365,3.0390360355377197,3.795919895172119}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******璇玑屏
             * 
             * 借由黄金、黑曜岩与强者的余裕，构建出坚固的璇玑屏，并造成岩元素范围伤害。
             * 
             * **璇玑屏**
             * ·阻挡敌人发射的投射物；
             * ·耐久度按比例继承凝光的生命值上限。
             * 
             * 璇玑屏被视为岩元素创造物，可以阻挡部分攻击，不可攀爬。同时只能存在一个。
             * 
             * 继承生命|{param3:F1P}
             * 技能伤害|{param2:P}
             * 冷却时间|{param4:F1}秒
            */
            void 凝光::E(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[4]{ -0.49900001287460327,2.303999900817871,0.5009999871253967,12},
                        new const double[4]{ -0.4690000116825104,2.476799964904785,0.531000018119812,12},
                        new const double[4]{ -0.4390000104904175,2.649600028991699,0.5609999895095825,12},
                        new const double[4]{ -0.4000000059604645,2.880000114440918,0.6000000238418579,12},
                        new const double[4]{ -0.3700000047683716,3.052799940109253,0.6299999952316284,12},
                        new const double[4]{ -0.3400000035762787,3.225600004196167,0.6600000262260437,12},
                        new const double[4]{ -0.3009999990463257,3.4560000896453857,0.6990000009536743,12},
                        new const double[4]{ -0.2619999945163727,3.6863999366760254,0.7379999756813049,12},
                        new const double[4]{ -0.22300000488758087,3.916800022125244,0.7770000100135803,12},
                        new const double[4]{ -0.18400000035762787,4.147200107574463,0.8159999847412109,12},
                        new const double[4]{ -0.14499999582767487,4.377600193023682,0.8550000190734863,12},
                        new const double[4]{ -0.10599999874830246,4.607999801635742,0.8939999938011169,12},
                        new const double[4]{ -0.06700000166893005,4.895999908447266,0.9330000281333923,12},
                        new const double[4]{ -0.02800000086426735,5.184000015258789,0.972000002861023,12},
                        new const double[4]{ 0.010999999940395355,5.4720001220703125,1.0110000371932983,12}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******天权崩玉
             * 
             * 凝光在身边凝聚诸多宝石，散之一瞬，自动索敌打击附近的敌人，造成大量岩元素伤害。
             * 施放天权崩玉时，如果附近有璇玑屏存在，璇玑屏将发射额外的宝石飞弹协同攻击。
             * 
             * 宝石伤害|每个{param1:F1P}
             * 冷却时间|{param2:F1}秒
             * 元素能量|{param3:I}
            */
            void 凝光::Q(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[3]{ 0.8695999979972839,12,40},
                        new const double[3]{ 0.9348199963569641,12,40},
                        new const double[3]{ 1.000040054321289,12,40},
                        new const double[3]{ 1.0870000123977661,12,40},
                        new const double[3]{ 1.1522200107574463,12,40},
                        new const double[3]{ 1.2174400091171265,12,40},
                        new const double[3]{ 1.3043999671936035,12,40},
                        new const double[3]{ 1.3913600444793701,12,40},
                        new const double[3]{ 1.4783200025558472,12,40},
                        new const double[3]{ 1.5652799606323242,12,40},
                        new const double[3]{ 1.6522400379180908,12,40},
                        new const double[3]{ 1.7391999959945679,12,40},
                        new const double[3]{ 1.8479000329971313,12,40},
                        new const double[3]{ 1.9565999507904053,12,40},
                        new const double[3]{ 2.0652999877929688,12,40}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };
        /*****凝光
        
            ***1命***
            悬星尽散击云碎            
            普通攻击命中时，会造成范围伤害。
            
            ***2命***
            璇玑合璧镇昆仑            
            ❤璇玑屏❤碎裂时，会清除冷却时间。该效果每6秒只能触发一次。
            
            ***3命***
            星罗宿列天权临            
            ❤天权崩玉❤的技能等级提高3级。至多提升至15级。
            
            ***4命***
            攻守易形著神机            
            ❤璇玑屏❤会使周围角色的所有元素抗性提升10%。
            
            ***5命***
            琼屏千扇正天衡            
            ❤璇玑屏❤的技能等级提高3级。至多提升至15级。
            
            ***6命***
            七星璨璨凝流光            
            施放❤天权崩玉❤时，会为凝光生成七枚星璇。
            
        */
         
        