#pragma once
        #include "凯亚.h"
        using namespace DB::RoleConstruct;
        using namespace Atom;
        using namespace Atom::Enum;
        using namespace Advanced;
        using namespace Professional;
        //TODO:AUTO凯亚.cpp
        const double HP =  11636.159044503409;
        const double ATK =  223.01705909465636;
        const double DEF =  791.7249344700394;
        //元素充能效率
        const double OTHER = 0.26669999957084656;
        
        凯亚::~凯亚() {
        }
        凯亚::凯亚(u32* frameCur):Role(frameCur) {
            BaseObject* baseData = new BaseObject();
            static Attr
			* HelathAttr = new Attr(HP, 0., 0.),
			* AtkAttr = new Attr(ATK, 0., 0.),
			* DefAttr = new Attr(DEF, 0., 0.),
			* CritRateAttr = new Attr(0.05, 0., 0.),
			* CritDamageAttr = new Attr(0.5, 0., 0.);
            baseData->SetAttr(HelathAttr,AttrType::Helath);
		    baseData->SetAttr(AtkAttr,AttrType::Atk);
		    baseData->SetAttr(DefAttr,AttrType::Def);
		    baseData->SetAttr(CritRateAttr,AttrType::CritRate);
		    baseData->SetAttr(CritDamageAttr,AttrType::CritDamage);
            this->rawCharacter = new Character(baseData, CharacterGender::Male, CharacterGroup::Tivat, ElementType::Cryo, WeaponType::Sword);
            delete baseData;
        };        

        /*
        
        ****1:冷血之剑
        ****************
        
            ❤霜袭❤每击中一个单位，便为凯亚恢复等同于攻击力15%的生命值。 

        ****************
        

        ****2:冰渊之心
        ****************
        
            ❤霜袭❤使敌人冻结时，被冻结的敌人会掉落额外的元素微粒。
            一次霜袭至多因此产生2个额外元素微粒。 

        ****************
        

        ****3:隐藏的实力
        ****************
        
            队伍中自己的角色冲刺消耗的体力降低20%。
            无法与效果完全相同的固有天赋叠加。 

        ****************
        
        */
        
            /*******普通攻击·仪典剑术
             * 
             * **普通攻击**
             * 进行至多五段的连续剑击。
             * 
             * **重击**
             * 消耗一定体力，瞬间向前方挥出两剑。
             * 
             * **下落攻击**
             * 从空中下坠冲击地面，攻击下落路径上的敌人，并在落地时造成范围伤害。
             * 
             * 一段伤害|{param1:F1P}
             * 二段伤害|{param2:F1P}
             * 三段伤害|{param3:F1P}
             * 四段伤害|{param4:F1P}
             * 五段伤害|{param5:F1P}
             * 重击伤害|{param6:F1P}+{param7:F1P}
             * 重击体力消耗|{param8:F1}点
             * 下坠期间伤害|{param9:F1P}
             * 低空/高空坠地冲击伤害|{param10:P}/{param11:P}
            */
            void 凯亚::A(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[11]{ 0.5375000238418579,0.5168600082397461,0.6527400016784668,0.7086399793624878,0.8823599815368652,0.5504000186920166,0.7310000061988831,20,0.6393240094184875,1.2783770561218262,1.59676194190979},
                        new const double[11]{ 0.581250011920929,0.558929979801178,0.7058699727058411,0.766319990158081,0.9541800022125244,0.5952000021934509,0.7904999852180481,20,0.6913620233535767,1.3824310302734375,1.7267309427261353},
                        new const double[11]{ 0.625,0.6010000109672546,0.7590000033378601,0.8240000009536743,1.0260000228881836,0.6399999856948853,0.8500000238418579,20,0.743399977684021,1.4864850044250488,1.8566999435424805},
                        new const double[11]{ 0.6875,0.6610999703407288,0.8349000215530396,0.9064000248908997,1.128600001335144,0.7039999961853027,0.9350000023841858,20,0.8177400231361389,1.635133981704712,2.042370080947876},
                        new const double[11]{ 0.731249988079071,0.7031700015068054,0.8880299925804138,0.9640799760818481,1.2004200220108032,0.7487999796867371,0.9944999814033508,20,0.8697779774665833,1.7391870021820068,2.1723389625549316},
                        new const double[11]{ 0.78125,0.7512500286102295,0.9487500190734863,1.0299999713897705,1.2825000286102295,0.800000011920929,1.0625,20,0.9292500019073486,1.858106017112732,2.3208749294281006},
                        new const double[11]{ 0.8500000238418579,0.817359983921051,1.0322400331497192,1.1206400394439697,1.395359992980957,0.8704000115394592,1.156000018119812,20,1.011023998260498,2.021620035171509,2.5251119136810303},
                        new const double[11]{ 0.918749988079071,0.8834699988365173,1.1157300472259521,1.2112799882888794,1.5082199573516846,0.9408000111579895,1.249500036239624,20,1.0927979946136475,2.1851329803466797,2.72934889793396},
                        new const double[11]{ 0.987500011920929,0.9495800137519836,1.1992199420928955,1.3019200563430786,1.6210800409317017,1.011199951171875,1.343000054359436,20,1.1745719909667969,2.3486459255218506,2.9335858821868896},
                        new const double[11]{ 1.0625,1.0217000246047974,1.2903000116348267,1.4007999897003174,1.7441999912261963,1.0880000591278076,1.4450000524520874,20,1.2637799978256226,2.527024984359741,3.1563899517059326},
                        new const double[11]{ 1.1484379768371582,1.1043369770050049,1.3946620225906372,1.5140999555587769,1.8852750062942505,1.1759999990463257,1.5618749856948853,20,1.3529880046844482,2.7054030895233154,3.3791940212249756},
                        new const double[11]{ 1.249500036239624,1.2015190124511719,1.5173929929733276,1.647341012954712,2.0511789321899414,1.27948796749115,1.6993199586868286,20,1.442196011543274,2.8837809562683105,3.6019980907440186},
                        new const double[11]{ 1.3505619764328003,1.2987010478973389,1.6401230096817017,1.7805819511413574,2.217082977294922,1.3829760551452637,1.8367650508880615,20,1.5314040184020996,3.0621590614318848,3.8248019218444824},
                        new const double[11]{ 1.4516249895095825,1.3958829641342163,1.7628530263900757,1.913822054862976,2.3829879760742188,1.486464023590088,1.9742100238800049,20,1.6206120252609253,3.24053692817688,4.047605991363525},
                        new const double[11]{ 1.5618749856948853,1.501899003982544,1.8967410326004028,2.059175968170166,2.563973903656006,1.5993599891662598,2.124150037765503,20,1.709820032119751,3.418915033340454,4.270410060882568}                    
                };  
                const double* curData = SkillPrama[cmd & 0xFF];
                ////////下面是技能实现   
            };


            /*******霜袭
             * 
             * 瞬间放出急冻的寒气，对前方的敌人造成冰元素伤害。
             * 
             * 技能伤害|{param1:P}
             * 冷却时间|{param2:F1}秒
            */
            void 凯亚::E(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[2]{ 1.9119999408721924,6},
                        new const double[2]{ 2.0553998947143555,6},
                        new const double[2]{ 2.1988000869750977,6},
                        new const double[2]{ 2.390000104904175,6},
                        new const double[2]{ 2.533400058746338,6},
                        new const double[2]{ 2.676800012588501,6},
                        new const double[2]{ 2.868000030517578,6},
                        new const double[2]{ 3.0592000484466553,6},
                        new const double[2]{ 3.2504000663757324,6},
                        new const double[2]{ 3.4416000843048096,6},
                        new const double[2]{ 3.6328001022338867,6},
                        new const double[2]{ 3.8239998817443848,6},
                        new const double[2]{ 4.063000202178955,6},
                        new const double[2]{ 4.302000045776367,6},
                        new const double[2]{ 4.540999889373779,6}                    
                };  
                const double* curData = SkillPrama[cmd & 0xFF];
                ////////下面是技能实现   
            };


            /*******凛冽轮舞
             * 
             * 凝聚空气中的寒霜，召唤3枚围绕自身旋转的寒冰之棱。
             * 存在期间内，寒冰之棱会跟随角色运动，对路径上的敌人造成冰元素伤害。
             * 
             * 技能伤害|{param1:F1P}
             * 冷却时间|{param2:F1}秒
             * 持续时间|{param3:F1}秒
             * 元素能量|{param4:I}
            */
            void 凯亚::Q(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[4]{ 0.7760000228881836,15,8,60},
                        new const double[4]{ 0.8342000246047974,15,8,60},
                        new const double[4]{ 0.8924000263214111,15,8,60},
                        new const double[4]{ 0.9700000286102295,15,8,60},
                        new const double[4]{ 1.0282000303268433,15,8,60},
                        new const double[4]{ 1.086400032043457,15,8,60},
                        new const double[4]{ 1.1640000343322754,15,8,60},
                        new const double[4]{ 1.2416000366210938,15,8,60},
                        new const double[4]{ 1.319200038909912,15,8,60},
                        new const double[4]{ 1.3968000411987305,15,8,60},
                        new const double[4]{ 1.4744000434875488,15,8,60},
                        new const double[4]{ 1.5520000457763672,15,8,60},
                        new const double[4]{ 1.6490000486373901,15,8,60},
                        new const double[4]{ 1.746000051498413,15,8,60},
                        new const double[4]{ 1.843000054359436,15,8,60}                    
                };  
                const double* curData = SkillPrama[cmd & 0xFF];
                ////////下面是技能实现   
            };
        /*****凯亚
        
            ***1命***
            卓越的血脉            
            对受到冰元素影响的敌人，凯亚的普通攻击与重击暴击率提升15%。
            
            ***2命***
            无尽的霜舞            
            在❤凛冽轮舞❤的持续时间内击败敌人时，持续时间延长2.5秒，最多不会超过15秒。
            
            ***3命***
            凛冽的冰戏            
            ❤霜袭❤的技能等级提高3级。至多提升至15级。
            
            ***4命***
            极寒的轻吻            
            凯亚的生命值低于20%时自动触发：生成一个伤害吸收量等于生命值上限30%的护盾，持续20秒。该护盾对冰元素伤害有250%的吸收效果。该效果每60秒只能触发一次。
            
            ***5命***
            至冷的拥抱            
            ❤凛冽轮舞❤的技能等级提高3级。至多提升至15级。
            
            ***6命***
            轮旋的冰凌            
            ❤凛冽轮舞❤会产生一个额外的寒冰之棱，并在施放时返还15点元素能量。
            
        */
         
        