#pragma once
        #include "托马.h"
        using namespace DB::RoleConstruct;
        using namespace Atom;
        using namespace Atom::Enum;
        using namespace Advanced;
        using namespace Professional;
        //TODO:AUTO托马.cpp
        const double HP =  10331.16928589932;
        const double ATK =  201.77733869931944;
        const double DEF =  750.7736681492424;
        //攻击力
        const double OTHER = 0.23999999463558197;
        
        托马::~托马() {
        }
        托马::托马(u32* frameCur):Role(frameCur) {
            BaseObject* baseData = new BaseObject();
            static Attr
			* HelathAttr = new Attr(HP, 0., 0.),
			* AtkAttr = new Attr(ATK, 0., 0.),
			* DefAttr = new Attr(DEF, 0., 0.),
			* CritRateAttr = new Attr(0.05, 0., 0.),
			* CritDamageAttr = new Attr(0.5, 0., 0.);
            baseData->SetAttr((u32)AttrType::Helath, HelathAttr);
		    baseData->SetAttr((u32)AttrType::Atk, AtkAttr);
		    baseData->SetAttr((u32)AttrType::Def, DefAttr);
		    baseData->SetAttr((u32)AttrType::CritRate, CritRateAttr);
		    baseData->SetAttr((u32)AttrType::CritDamage, CritDamageAttr);
            this->rawCharacter = new Character(baseData, CharacterGender::Male, CharacterGroup::Tivat, ElementType::Pyro, WeaponType::Polearm);
            delete baseData;
        };        

        /*
        
        ****1:甲衣交叠
        ****************
        
            当前场上自己的角色获取或刷新❤烈烧佑命护盾❤时，护盾强效提升5%，持续时间6秒。
            此效果每0.3秒至多触发一次，至多叠加5次。 

        ****************
        

        ****2:烈火攻燔
        ****************
        
            ❤真红炽火之大铠❤的炽火崩破造成的伤害提高，提高值相当于托马生命值上限的2.2%。 

        ****************
        

        ****3:悬鲷狩
        ****************
        
            旅行者在稻妻成功❤钓鱼❤时，因为托马的帮助，有20%概率获得2倍产出。 

        ****************
        
        */
        
            /*******普通攻击·迅破枪势
             * 
             * **普通攻击**
             * 进行至多四段的连续枪击。
             * 
             * **重击**
             * 消耗一定体力，向前方突进，对路径上的敌人造成伤害。
             * 
             * **下落攻击**
             * 从空中下坠冲击地面，攻击下落路径上的敌人，并在落地时造成范围伤害。
             * 
             * 一段伤害|{param1:F1P}
             * 二段伤害|{param2:F1P}
             * 三段伤害|{param3:F1P}*2
             * 四段伤害|{param4:F1P}
             * 重击伤害|{param5:P}
             * 重击体力消耗|{param6:F1}点
             * 下坠期间伤害|{param7:F1P}
             * 低空/高空坠地冲击伤害|{param8:P}/{param9:P}
            */
            void 托马::A(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[9]{ 0.4439319968223572,0.43627798557281494,0.26789000630378723,0.6735519766807556,1.12746000289917,25,0.6393240094184875,1.2783770561218262,1.59676194190979},
                        new const double[9]{ 0.4800660014152527,0.47178900241851807,0.28969499468803406,0.7283759713172913,1.219230055809021,25,0.6913620233535767,1.3824310302734375,1.7267309427261353},
                        new const double[9]{ 0.5162000060081482,0.5073000192642212,0.31150001287460327,0.7832000255584717,1.3109999895095825,25,0.743399977684021,1.4864850044250488,1.8566999435424805},
                        new const double[9]{ 0.5678200125694275,0.5580300092697144,0.34264999628067017,0.861519992351532,1.4421000480651855,25,0.8177400231361389,1.635133981704712,2.042370080947876},
                        new const double[9]{ 0.603954017162323,0.5935410261154175,0.3644550144672394,0.9163439869880676,1.533869981765747,25,0.8697779774665833,1.7391870021820068,2.1723389625549316},
                        new const double[9]{ 0.6452500224113464,0.6341249942779541,0.3893750011920929,0.9789999723434448,1.6387499570846558,25,0.9292500019073486,1.858106017112732,2.3208749294281006},
                        new const double[9]{ 0.7020320296287537,0.6899279952049255,0.42364001274108887,1.0651520490646362,1.782960057258606,25,1.011023998260498,2.021620035171509,2.5251119136810303},
                        new const double[9]{ 0.7588139772415161,0.745730996131897,0.45790499448776245,1.151304006576538,1.9271700382232666,25,1.0927979946136475,2.1851329803466797,2.72934889793396},
                        new const double[9]{ 0.8155959844589233,0.8015339970588684,0.4921700060367584,1.23745596408844,2.0713798999786377,25,1.1745719909667969,2.3486459255218506,2.9335858821868896},
                        new const double[9]{ 0.8775399923324585,0.8624100089073181,0.5295500159263611,1.3314399719238281,2.2286999225616455,25,1.2637799978256226,2.527024984359741,3.1563899517059326},
                        new const double[9]{ 0.9394840002059937,0.9232860207557678,0.5669299960136414,1.4254239797592163,2.3860199451446533,25,1.3529880046844482,2.7054030895233154,3.3791940212249756},
                        new const double[9]{ 1.0014280080795288,0.9841619729995728,0.6043099761009216,1.5194079875946045,2.543339967727661,25,1.442196011543274,2.8837809562683105,3.6019980907440186},
                        new const double[9]{ 1.063372015953064,1.0450379848480225,0.6416900157928467,1.6133919954299927,2.700659990310669,25,1.5314040184020996,3.0621590614318848,3.8248019218444824},
                        new const double[9]{ 1.1253160238265991,1.1059139966964722,0.679069995880127,1.7073760032653809,2.8579800128936768,25,1.6206120252609253,3.24053692817688,4.047605991363525},
                        new const double[9]{ 1.1872600317001343,1.1667900085449219,0.7164499759674072,1.801360011100769,3.0153000354766846,25,1.709820032119751,3.418915033340454,4.270410060882568}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******烈烧佑命之侍护
             * 
             * 托马以枪尖刺地作为支点，倾注燃焰之力，向前迅猛踢击，造成火元素范围伤害，唤出护体的烈烧佑命护盾，并在施放的瞬间，为托马施加火元素附着。
             * 护盾的伤害吸收量受益于托马的生命值上限。
             * 烈烧佑命护盾具有如下特性：
             * ·对火元素伤害有250%的吸收效果；
             * ·护盾剩余的伤害吸收量在获取新的烈烧佑命护盾时将会叠加，并刷新持续时间。
             * 
             * 护盾的伤害吸收量至多不超过托马生命值上限的一定比例。
             * 
             * 技能伤害|{param1:P}
             * 护盾吸收量|{param2:F1P}生命值上限+{param3:I}
             * 护盾持续时间|{param4:F1}秒
             * 护盾吸收量上限|{param5:F1P}生命值上限+{param6:I}
             * 冷却时间|{param7:F1}秒
            */
            void 托马::E(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[7]{ 1.4639999866485596,0.07199999690055847,693.3348388671875,8,0.19599999487400055,1887.419921875,15},
                        new const double[7]{ 1.573799967765808,0.07739999890327454,762.677978515625,8,0.21070000529289246,2076.188232421875,15},
                        new const double[7]{ 1.6835999488830566,0.0828000009059906,837.7996826171875,8,0.22540000081062317,2280.68701171875,15},
                        new const double[7]{ 1.8300000429153442,0.09000000357627869,918.7000122070312,8,0.24500000476837158,2500.916748046875,15},
                        new const double[7]{ 1.9398000240325928,0.09539999812841415,1005.37890625,8,0.2597000002861023,2736.876953125,15},
                        new const double[7]{ 2.0495998859405518,0.10080000013113022,1097.83642578125,8,0.274399995803833,2988.56787109375,15},
                        new const double[7]{ 2.196000099182129,0.1080000028014183,1196.072509765625,8,0.2939999997615814,3255.98974609375,15},
                        new const double[7]{ 2.342400074005127,0.1151999980211258,1300.087158203125,8,0.31360000371932983,3539.14208984375,15},
                        new const double[7]{ 2.488800048828125,0.12240000069141388,1409.8804931640625,8,0.33320000767707825,3838.02490234375,15},
                        new const double[7]{ 2.635200023651123,0.12960000336170197,1525.4522705078125,8,0.35280001163482666,4152.638671875,15},
                        new const double[7]{ 2.781599998474121,0.13680000603199005,1646.802734375,8,0.3723999857902527,4482.98291015625,15},
                        new const double[7]{ 2.927999973297119,0.14399999380111694,1773.931884765625,8,0.3919999897480011,4829.05810546875,15},
                        new const double[7]{ 3.1110000610351562,0.15299999713897705,1906.8394775390625,8,0.4165000021457672,5190.8642578125,15},
                        new const double[7]{ 3.2939999103546143,0.16200000047683716,2045.5257568359375,8,0.4410000145435333,5568.400390625,15},
                        new const double[7]{ 3.4769999980926514,0.17100000381469727,2189.990478515625,8,0.46549999713897705,5961.66748046875,15}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };


            /*******真红炽火之大铠
             * 
             * 托马旋转长枪，以炽烈的燃焰挥斩周围的敌人，造成火元素范围伤害，并产生炽火大铠。
             * 
             * **炽火大铠**
             * 处于炽火大铠效果下的当前场上角色进行普通攻击时，将触发炽火崩破，造成火元素范围伤害，并唤出护体的烈烧佑命护盾。
             * 炽火崩破每1秒至多触发一次。
             * 
             * 产生的护盾，除伤害吸收量以外，特性与元素战技「烈烧佑命之侍护」的护盾相同：
             * ·对火元素伤害有250%的吸收效果；
             * ·护盾剩余的伤害吸收量在获取新的烈烧佑命护盾时将会叠加，并刷新持续时间。
             * 
             * 护盾的伤害吸收量至多不超过托马生命值上限的一定比例。
             * 
             * 托马倒下时，将会清除炽火大铠的效果。
             * 
             * 技能伤害|{param1:P}
             * 炽火崩破伤害|{param2:P}
             * 护盾吸收量|{param3:F1P}生命值上限+{param4:I}
             * 护盾持续时间|{param5:F1}秒
             * 炽火大铠持续时间|{param7:F1}秒
             * 冷却时间|{param8:F1}秒
             * 元素能量|{param9:I}
            */
            void 托马::Q(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[9]{ 0.8799999952316284,0.5799999833106995,0.01143999956548214,110.03398132324219,8,1,15,20,80},
                        new const double[9]{ 0.9459999799728394,0.6234999895095825,0.012298000045120716,121.03890991210938,8,1,15,20,80},
                        new const double[9]{ 1.0119999647140503,0.6669999957084656,0.013155999593436718,132.96092224121094,8,1,15,20,80},
                        new const double[9]{ 1.100000023841858,0.7250000238418579,0.014299999922513962,145.8000030517578,8,1,15,20,80},
                        new const double[9]{ 1.1660000085830688,0.7684999704360962,0.015158000402152538,159.55616760253906,8,1,15,20,80},
                        new const double[9]{ 1.2319999933242798,0.8119999766349792,0.016016000881791115,174.22940063476562,8,1,15,20,80},
                        new const double[9]{ 1.3200000524520874,0.8700000047683716,0.017160000279545784,189.81971740722656,8,1,15,20,80},
                        new const double[9]{ 1.4079999923706055,0.9279999732971191,0.018303999677300453,206.3271026611328,8,1,15,20,80},
                        new const double[9]{ 1.496000051498413,0.9860000014305115,0.019447999075055122,223.75157165527344,8,1,15,20,80},
                        new const double[9]{ 1.5839999914169312,1.0440000295639038,0.02059200033545494,242.09312438964844,8,1,15,20,80},
                        new const double[9]{ 1.6720000505447388,1.1019999980926514,0.02173599973320961,261.35174560546875,8,1,15,20,80},
                        new const double[9]{ 1.7599999904632568,1.159999966621399,0.02287999913096428,281.5274353027344,8,1,15,20,80},
                        new const double[9]{ 1.8700000047683716,1.2324999570846558,0.024310000240802765,302.6202087402344,8,1,15,20,80},
                        new const double[9]{ 1.9800000190734863,1.3049999475479126,0.0257399994879961,324.63006591796875,8,1,15,20,80},
                        new const double[9]{ 2.0899999141693115,1.377500057220459,0.027170000597834587,347.5570068359375,8,1,15,20,80}                    
                };  
                const double* curData = SkillPrama[cmd && 0xFF];
                ////////下面是技能实现   
            };
        /*****托马
        
            ***1命***
            同袍的义理            
            处于托马自己的❤烈烧佑命护盾❤庇护下的角色（除了托马自己）受到攻击时，托马自己的❤烈烧佑命之侍护❤的冷却时间减少3秒，❤真红炽火之大铠❤的冷却时间减少3秒。该效果每20秒至多触发一次。
            
            ***2命***
            僚佐的才巧            
            ❤真红炽火之大铠❤的持续时间延长3秒。
            
            ***3命***
            御敌的执定            
            ❤烈烧佑命之侍护❤的技能等级提高3级。至多提升至15级。
            
            ***4命***
            用臣的久计            
            施放❤真红炽火之大铠❤后，为托马恢复15点元素能量。
            
            ***5命***
            野火的豪烈            
            ❤真红炽火之大铠❤的技能等级提高3级。至多提升至15级。
            
            ***6命***
            炽烧的至心            
            获取或刷新❤烈烧佑命护盾❤时，队伍中所有角色的普通攻击，重击与下落攻击造成的伤害提升15%，持续6秒。
            
        */
         
        