#pragma once
        #include "迪卢克.h"
        using namespace DB::RoleConstruct;
        using namespace Atom;
        using namespace Atom::Enum;
        using namespace Advanced;
        using namespace Professional;
        //TODO:AUTO迪卢克.cpp
        const double HP =  12980.666121717892;
        const double ATK =  334.84974830517604;
        const double DEF =  783.9254743546844;
        //暴击率
        const double OTHER = 0.2420000024139881;
        
        迪卢克::~迪卢克() {
        }
        迪卢克::迪卢克(u32* frameCur):Role(frameCur) {
            BaseObject* baseData = new BaseObject();
            static Attr
			* HelathAttr = new Attr(HP, 0., 0.),
			* AtkAttr = new Attr(ATK, 0., 0.),
			* DefAttr = new Attr(DEF, 0., 0.),
			* CritRateAttr = new Attr(0.05, 0., 0.),
			* CritDamageAttr = new Attr(0.5, 0., 0.);
            baseData->SetAttr(HelathAttr,AttrType::Helath);
		    baseData->SetAttr(AtkAttr,AttrType::Atk);
		    baseData->SetAttr(DefAttr,AttrType::Def);
		    baseData->SetAttr(CritRateAttr,AttrType::CritRate);
		    baseData->SetAttr(CritDamageAttr,AttrType::CritDamage);
            this->rawCharacter = new Character(baseData, CharacterGender::Male, CharacterGroup::Tivat, ElementType::Pyro, WeaponType::Claymore);
            delete baseData;
        };        

        /*
        
        ****1:永不休止
        ****************
        
            迪卢克的重击体力消耗降低50%，最大持续时间增加3秒。 

        ****************
        

        ****2:熔毁之翼
        ****************
        
            ❤黎明❤提供的火元素附魔持续时间延长4秒；此外，在效果持续期间，迪卢克获得20%火元素伤害加成。 

        ****************
        

        ****3:晨曦的传统
        ****************
        
            锻造双手剑类武器时，返还15%消耗的矿石。 

        ****************
        
        */
        
            /*******普通攻击·淬炼之剑
             * 
             * **普通攻击**
             * 进行至多四段的连续挥砍。
             * 
             * **重击**
             * 持续消耗体力，快速进行连续的斩击。
             * 重击结束时，会进行一次格外有力的挥砍。
             * 
             * **下落攻击**
             * 从空中下坠冲击地面，攻击下落路径上的敌人，并在落地时造成范围伤害。
             * 
             * 一段伤害|{param1:F1P}
             * 二段伤害|{param2:F1P}
             * 三段伤害|{param3:F1P}
             * 四段伤害|{param4:P}
             * 重击循环伤害|{param5:F1P}
             * 重击终结伤害|{param6:P}
             * 重击体力消耗|每秒{param7:F1}点
             * 最大持续时间|{param8:F1}秒
             * 下坠期间伤害|{param9:F1P}
             * 低空/高空坠地冲击伤害|{param10:P}/{param11:P}
            */
            void 迪卢克::A(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[11]{ 0.8969799876213074,0.8763399720191956,0.9881399869918823,1.3398799896240234,0.6880000233650208,1.246999979019165,40,5,0.8950539827346802,1.789728045463562,2.235466957092285},
                        new const double[11]{ 0.9699900150299072,0.9476699829101562,1.0685700178146362,1.4489400386810303,0.7440000176429749,1.3485000133514404,40,5,0.9679070115089417,1.9354029893875122,2.4174230098724365},
                        new const double[11]{ 1.0429999828338623,1.0190000534057617,1.1490000486373901,1.5579999685287476,0.800000011920929,1.4500000476837158,40,5,1.0407600402832031,2.0810790061950684,2.5993800163269043},
                        new const double[11]{ 1.1473000049591064,1.12090003490448,1.2639000415802002,1.7137999534606934,0.8799999952316284,1.5950000286102295,40,5,1.1448359489440918,2.289186954498291,2.8593180179595947},
                        new const double[11]{ 1.2203099727630615,1.192229986190796,1.3443299531936646,1.8228600025177002,0.9359999895095825,1.6964999437332153,40,5,1.217689037322998,2.434861898422241,3.0412750244140625},
                        new const double[11]{ 1.3037500381469727,1.2737499475479126,1.4362499713897705,1.9474999904632568,1,1.8125,40,5,1.300950050354004,2.601349115371704,3.249224901199341},
                        new const double[11]{ 1.4184800386428833,1.3858400583267212,1.5626399517059326,2.118880033493042,1.0880000591278076,1.972000002861023,40,5,1.4154340028762817,2.8302669525146484,3.5351569652557373},
                        new const double[11]{ 1.533210039138794,1.4979300498962402,1.6890300512313843,2.290260076522827,1.1759999990463257,2.131500005722046,40,5,1.5299170017242432,3.0591859817504883,3.821089029312134},
                        new const double[11]{ 1.6479400396347046,1.6100200414657593,1.8154200315475464,2.461639881134033,1.2640000581741333,2.2909998893737793,40,5,1.644400954246521,3.288105010986328,4.107019901275635},
                        new const double[11]{ 1.7731000185012817,1.732300043106079,1.9532999992370605,2.6486001014709473,1.3600000143051147,2.4649999141693115,40,5,1.7692919969558716,3.5378339290618896,4.418945789337158},
                        new const double[11]{ 1.9165129661560059,1.8724119663238525,2.1112871170043945,2.8628249168395996,1.4700000286102295,2.664375066757202,40,5,1.8941830396652222,3.7875640392303467,4.73087215423584},
                        new const double[11]{ 2.0851659774780273,2.037184953689575,2.2970809936523438,3.1147539615631104,1.5993599891662598,2.8988399505615234,40,5,2.019073963165283,4.037292957305908,5.042797088623047},
                        new const double[11]{ 2.253818988800049,2.2019569873809814,2.4828739166259766,3.3666820526123047,1.72871994972229,3.133305072784424,40,5,2.14396595954895,4.287023067474365,5.35472297668457},
                        new const double[11]{ 2.4224720001220703,2.3667290210723877,2.6686670780181885,3.6186110973358154,1.8580800294876099,3.367769956588745,40,5,2.268857002258301,4.536752223968506,5.666647911071777},
                        new const double[11]{ 2.606456995010376,2.546480894088745,2.8713510036468506,3.893441915512085,1.9991999864578247,3.6235499382019043,40,5,2.3937480449676514,4.786481857299805,5.978573799133301}                    
                };  
                const double* curData = SkillPrama[cmd & 0xFF];
                ////////下面是技能实现   
            };


            /*******逆焰之刃
             * 
             * 挥舞大剑向前劈砍，造成火元素伤害。
             * 
             * 可以连续施放3次。
             * 若在短时间内没有施放，则会进入冷却。
             * 
             * 一段伤害|{param1:F1P}
             * 二段伤害|{param2:F1P}
             * 三段伤害|{param3:P}
             * 冷却时间|{param4:F1}秒
            */
            void 迪卢克::E(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[4]{ 0.9440000057220459,0.9760000109672546,1.2879999876022339,10},
                        new const double[4]{ 1.014799952507019,1.0492000579833984,1.384600043296814,10},
                        new const double[4]{ 1.0856000185012817,1.1224000453948975,1.4811999797821045,10},
                        new const double[4]{ 1.1799999475479126,1.2200000286102295,1.6100000143051147,10},
                        new const double[4]{ 1.2508000135421753,1.2932000160217285,1.7065999507904053,10},
                        new const double[4]{ 1.3215999603271484,1.3664000034332275,1.8032000064849854,10},
                        new const double[4]{ 1.4160000085830688,1.4639999866485596,1.9320000410079956,10},
                        new const double[4]{ 1.5104000568389893,1.5615999698638916,2.060800075531006,10},
                        new const double[4]{ 1.6047999858856201,1.6591999530792236,2.1895999908447266,10},
                        new const double[4]{ 1.6992000341415405,1.7568000555038452,2.3183999061584473,10},
                        new const double[4]{ 1.7935999631881714,1.8544000387191772,2.447200059890747,10},
                        new const double[4]{ 1.8880000114440918,1.9520000219345093,2.5759999752044678,10},
                        new const double[4]{ 2.00600004196167,2.0739998817443848,2.736999988555908,10},
                        new const double[4]{ 2.124000072479248,2.196000099182129,2.8980000019073486,10},
                        new const double[4]{ 2.242000102996826,2.318000078201294,3.059000015258789,10}                    
                };  
                const double* curData = SkillPrama[cmd & 0xFF];
                ////////下面是技能实现   
            };


            /*******黎明
             * 
             * 爆发出烈焰的力量，击退周围的敌人，造成火元素伤害。随后，将烈焰凝聚在武器上，挥出向前飞行的火之鸟，对路径上的敌人造成高额火元素伤害，并在火之鸟行进的终点爆裂造成大量的火元素范围伤害。
             * 武器上凝聚的烈焰会使迪卢克获得火元素附魔。
             * 
             * 斩击伤害|{param1:P}
             * 持续伤害|{param2:F1P}
             * 爆裂伤害|{param3:P}
             * 冷却时间|{param4:F1}秒
             * 附魔持续时间|{param5:F1}秒
             * 元素能量|{param6:I}
            */
            void 迪卢克::Q(Role* role, u32 cmd) {
                const static double** SkillPrama = new const double* [15]{
                        new const double[6]{ 2.0399999618530273,0.6000000238418579,2.0399999618530273,12,8,40},
                        new const double[6]{ 2.193000078201294,0.6449999809265137,2.193000078201294,12,8,40},
                        new const double[6]{ 2.3459999561309814,0.6899999976158142,2.3459999561309814,12,8,40},
                        new const double[6]{ 2.549999952316284,0.75,2.549999952316284,12,8,40},
                        new const double[6]{ 2.703000068664551,0.7950000166893005,2.703000068664551,12,8,40},
                        new const double[6]{ 2.8559999465942383,0.8399999737739563,2.8559999465942383,12,8,40},
                        new const double[6]{ 3.059999942779541,0.8999999761581421,3.059999942779541,12,8,40},
                        new const double[6]{ 3.2639999389648438,0.9599999785423279,3.2639999389648438,12,8,40},
                        new const double[6]{ 3.4679999351501465,1.0199999809265137,3.4679999351501465,12,8,40},
                        new const double[6]{ 3.671999931335449,1.0800000429153442,3.671999931335449,12,8,40},
                        new const double[6]{ 3.875999927520752,1.1399999856948853,3.875999927520752,12,8,40},
                        new const double[6]{ 4.079999923706055,1.2000000476837158,4.079999923706055,12,8,40},
                        new const double[6]{ 4.335000038146973,1.274999976158142,4.335000038146973,12,8,40},
                        new const double[6]{ 4.590000152587891,1.350000023841858,4.590000152587891,12,8,40},
                        new const double[6]{ 4.84499979019165,1.4249999523162842,4.84499979019165,12,8,40}                    
                };  
                const double* curData = SkillPrama[cmd & 0xFF];
                ////////下面是技能实现   
            };
        /*****迪卢克
        
            ***1命***
            罪罚裁断            
            对生命值高于50%的敌人，迪卢克造成的伤害提高15%。
            
            ***2命***
            炙热余烬            
            迪卢克受到伤害时，攻击力提高10%，攻击速度提高5%，持续10秒。该效果至多叠加3次，每1.5秒只能触发一次。
            
            ***3命***
            钢铁炽焰            
            ❤逆焰之刃❤的技能等级提高3级。至多提升至15级。
            
            ***4命***
            流火焦灼            
            有节奏地释放❤逆焰之刃❤可以大幅提升造成的伤害。施放❤逆焰之刃❤的2秒后，使下一段逆焰之刃的伤害提高40%，持续2秒。
            
            ***5命***
            昭告黎明的火之鸟            
            ❤黎明❤的技能等级提高3级。至多提升至15级。
            
            ***6命***
            清算黑暗的炎之剑            
            施放❤逆焰之刃❤后，接下来6秒内的2次普通攻击速度提升30%，造成的伤害提高30%。此外，逆焰之刃不再重置普通攻击连击段数。
            
        */
         
        